[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
TMP_21
bytes
=
INTERNAL_CALL
Address
functionCall
address
string
target
data
:
low-level
call
failed
RETURN
TMP_16
uint256
SafeMath
mod
a
b
modulo
by
zero
msg
sender
TMP_9
+
c
TMP_10
bool
>=
TMP_11
None
SOLIDITY_CALL
assert
TMP_125
CONVERT
0
to
TMP_126
account
!=
TMP_127
require
ERC20
burn
from
the
TMP_128
_beforeTokenTransfer
amount
REF_26
->
_balances
accountBalance
TMP_130
TMP_131
exceeds
balance
REF_27
TMP_132
-
->_balances
_totalSupply
TMP_133
Emit
Transfer
TMP_135
_afterTokenTransfer
BEP20
_transfer
recipient
REF_1
mapping
=>
_allowances
TMP_32
Context
_msgSender
REF_2
currentAllowance
TMP_33
TMP_34
transfer
allowance
TMP_35
TMP_36
_approve
True
TMP_18
int256
TMP_19
TMP_20
<=
&&
TMP_22
<
TMP_23
>
TMP_24
TMP_25
||
TMP_26
TMP_68
_functionCallWithValue
errorMessage
UpgradeableProxy
_implementation
Proxy
_delegate
TMP_66
TMP_67
_owner
==
Ownable
caller
is
not
owner
REF_3
TMP_31
REF_4
_setImplementation
newImplementation
Upgraded
TMP_14
*
TheCryptSpaceDividendDistributor
addShareholder
shareholder
totalShares
REF_12
Share
shares
REF_13
->shares
REF_14
REF_15
totalExcluded
REF_16
REF_17
TMP_41
getCumulativeDividends
MODIFIER_CALL
onlyAdmin
TMP_1
this
TMP_2
TMP_3
TMP_4
insufficient
TUPLE_0
LOW_LEVEL_CALL
dest
function
arguments
''
value
success
UNPACK
index
TMP_5
unable
send
may
have
reverted
TMP_52
CONDITION
TMP_53
TMP_54
/
TMP_55
TMP_56
multiplication
overflow
paused
False
_IMPLEMENTATION_SLOT
bytes32
24440054405305269366569402256811496959409073762505157381672968839269610695612
_ADMIN_SLOT
81955473079516046949633743016697847541294818689821282749996681496272635257091
OwnershipTransferred
onlyOwner
TMP_29
TMP_30
newOwner
new
TMP_129
approve
spender
REF_52
REF_53
->_allowances
Approval
TMP_6
TMP_15
TMP_17
division
TMP_7
_mint
_to
_amount
MinterRole
onlyMinter
_IS_ALLOWED_PROXY_
_PENDING_ADD_DODO_PROXY_
->_IS_ALLOWED_PROXY_
DODOApproveProxy
lockAddProxy
InitializableOwnable
notLocked
18
TMP_27
TMP_28
REF_92
allowed
REF_93
_spender
oldValue
TMP_158
_subtractedValue
REF_94
REF_95
->allowed
REF_96
REF_97
TMP_159
LIBRARY_CALL
sub
'oldValue'
'_subtractedValue'
REF_99
REF_100
TMP_43
e
TMP_44
10
**
TMP_45
1
TMP_46
div
'e'
'2'
TMP_47
DecimalMath
powFloor
p
TMP_48
mul
'p'
TMP_49
TMP_50
TMP_51
%
2
'target'
TMP_115
REF_0
CODESIZE
size
TMP_82
TMP_83
TMP_84
returndata
REF_5
LENGTH
TMP_39
TMP_40
mload
returndata_size_verifyCallResult_asm_0
32
TMP_42
revert
TMP_65
TMP_69
TMP_71
TMP_72
TMP_73
TMP_74
->None
2835717307
abi
encodeWithSelector
SafeERC20
callOptionalReturn
IERC20
token
TMP_93
TMP_94
TMP_95
_addMinter
TUPLE_7
TycoonCoin
_getTValues
tAmount
tTransferAmount
tFee
bFee
tLiquidity
3
TMP_258
_getRate
TUPLE_8
_getRValues
rAmount
rTransferAmount
rFee
REF_72
_oneList
_maker
TMP_75
_decimals
_name
name
_symbol
symbol
uint8
decimals
REF_76
authorizations
adr
REF_143
left
mantissa
REF_144
right
TMP_271
TMP_780
admin
REF_573
TokenErrorReporter
Error
UNAUTHORIZED
REF_574
FailureInfo
SET_INTEREST_RATE_MODEL_OWNER_CHECK
TMP_781
fail
TMP_782
CToken
getBlockNumber
TMP_783
accrualBlockNumber
REF_575
MARKET_NOT_FRESH
REF_576
SET_INTEREST_RATE_MODEL_FRESH_CHECK
TMP_784
oldInterestRateModel
InterestRateModel
interestRateModel
TMP_785
HIGH_LEVEL_CALL
newInterestRateModel
isInterestRateModel
TMP_786
marker
method
returned
false
NewMarketInterestRateModel
REF_578
NO_ERROR
TMP_788
REF_29
set
_values
REF_30
TMP_12
TMP_13
EnumerableSet
out
of
bounds
REF_31
REF_32
TMP_387
TMP_388
TMP_389
cast
TMP_390
TMP_392
add
'_totalSupply'
'amount'
REF_151
REF_152
TMP_393
'REF_152'
TMP_394
returndata_size__verifyCallResult_asm_0
REF_11
decimals_
subtraction
isContract
delegate
non-contract
TUPLE_3
delegatecall
'data'
verifyCallResult
TMP_314
TMP_315
TMP_316
TMP_317
TMP_318
TMP_319
TMP_320
REF_129
LockCoin
TimeLockByAddress
mappingAddressToLock
_addressLock
REF_130
ScheduleLock
arrTimeLock
REF_131
_index
REF_132
REF_133
REF_134
REF_135
REF_136
unlockTime
TMP_2192
encodeWithSignature
log
uint
p0
p1
p2
p3
console
_sendLogPayload
TMP_79
TMP_58
TMP_59
TMP_60
_isExcludedFromReward
TMP_85
TMP_86
Forbidden
for
excluded
addresses
TMP_87
AbstractDeflationaryToken
TMP_88
_tFeeTotal
_rOwned
_rTotal
_rIncludedInReward
TMP_99
PETAVERSE
TMP_255
TransparentUpgradeableProxy
_admin
ifAdmin
TMP_57
TMP_327
TMP_328
MAX_UINT
TMP_329
TMP_0
_transferOwnership
_fallback
TMP_61
_setOwner
'REF_5'
_beforeFallback
TMP_194
TMP_493
_setReserveFactor
newReserveFactorMantissa
TMP_494
GErc20Delegator
delegateToImplementation
TMP_495
decode
_paused
TMP_112
Paused
Pausable
whenNotPaused
TMP_106
!
initialized
TMP_107
TMP_76
'TMP_75'
'SafeBEP20
failed'
REF_24
TMP_77
TMP_78
SafeBEP20
operation
did
succeed
TMP_100
REF_34
REF_35
TMP_101
'REF_35'
'addedValue'
Roles
Role
'_minters'
'account'
MinterAdded
TMP_332
TMP_333
TMP_334
REF_199
REF_200
TMP_335
'REF_200'
'ERC20
balance'
TMP_336
TMP_337
TMP_37
TMP_92
pendingOwner
REF_38
599290589
TMP_252
_operator
TMP_253
OperatorTransferred
REF_91
_excludedFromAntiWhale
->_excludedFromAntiWhale
TMP_256
BURN_ADDRESS
constructor
Frozencake
FROZEN
TMP_231
_burn
'TMP_72'
'spender'
non-zero
157198259
_callOptionalReturn
y
x
z
ds-math-mul-overflow
->authorizations
Auth
REF_126
TUPLE_31
CarefulMath
MathError
divUInt
scalar
err0
descaledMantissa
REF_127
TMP_248
TMP_249
Exp
REF_128
TMP_250
REF_246
MansaMusa
PoolInfo
poolInfo
_pid
pool
REF_247
UserInfo
userInfo
REF_248
user
REF_249
REF_250
->user
REF_251
rewardDebt
TMP_401
afrikan
AfrikanBar
balanceOf
'msg
sender'
afrikanBalance
TMP_402
'afrikanBalance'
REF_254
IBEP20
lpToken
TMP_404
safeTransfer
'REF_254'
'TMP_404'
EmergencyWithdraw
validatePoolByPid
TMP_124
enableMint
->enableMint
_mintEnable
JulSwap
validIndex
validValidatorAddress
TMP_179
uint64
addition
TMP_299
path
TMP_300
->path
TMP_301
uniswapV2Router
IUniswapV2Router02
WETH
TMP_302
TMP_303
AntiBotLiquidityGeneratorToken
tokenAmount
TMP_305
swapExactTokensForETHSupportingFeeOnTransferTokens
'tokenAmount'
'0'
'path'
'TMP_305'
'block
timestamp'
TMP_198
UniswapV2Router02
_swapRate
swapRateDimi
TMP_199
UniswapV2Library
getAmountsIn
'factory'
'amountOut'
'swapRateDimi'
amounts
REF_87
TMP_200
amountInMax
TMP_201
UniswapV2Router
EXCESSIVE_INPUT_AMOUNT
REF_89
TMP_202
pairFor
'REF_91'
'REF_92'
TransferHelper
safeTransferFrom
'REF_89'
'TMP_202'
'REF_93'
_swap
ensure
deadline
'TMP_78'
'SafeERC20
TMP_80
TMP_81
TMP_89
TMP_90
TMP_91
TMP_110
StandardToken
_value
'share'
'dividendsPerShare'
'TMP_91'
'dividendsPerShareAccuracyFactor'
TMP_134
TMP_136
TMP_137
TMP_138
TMP_139
TMP_141
mint
TMP_38
functionCallWithValue
with
TMP_8
swapAndLiquifyEnabled
_enabled
SwapAndLiquifyEnabledUpdated
TMP_322
sell
TMP_323
marketingFee
TMP_324
10000
marketing
TMP_325
liquidityFee
TMP_326
liquidity
sellIncreaseMarketing
TMP_330
TMP_331
sellIncreaseLiquidity
'REF_4'
allowance'
block
timestamp
functionStaticCall
static
tokens
tokenAddress
'tokens'
DividendDistributor
onlyToken
TMP_96
TMP_97
TMP_98
TMP_70
TMP_2360
CErc20Delegator
delegateToViewAndReturn
oldOwner
REF_160
excludedFromDividends
TMP_416
TMP_417
REF_161
->excludedFromDividends
DividendPayingToken
_setBalance
TokenDividendTracker
MAPRemove
ExcludeFromDividends
TMP_173
TMP_229
AngelNodeManager
_getNumberOfNodes
TMP_230
Cannot
claim
any
nodes
REF_171
Node
usersNodes
REF_172
TMP_233
idsClaimable
i
REF_173
TMP_234
REF_174
node
REF_175
nodeType
REF_176
NodeType
_nodeTypes
REF_177
upgrading
REF_178
angelUpgradeStartTimestamp
REF_179
timeToUpgrade
TMP_235
TMP_236
REF_180
REF_181
REF_182
id
->idsClaimable
TMP_237
TMP_120
implementation_
TMP_226
TMP_227
implementation
contract
slot
TMP_228
sstore
'TMP_90'
stakeFee
stakeFee_
emergencyFee
emergencyFee_
stakePlus
stakePlus_
stakeFeeAddress
stakeFeeAddress_
mfetToken_
mfetToken
MFETStake
addStakeRate
5
16
6
34
9
53
12
72
110
24
150
TMP_1328
ExponentialNoError
mul_
expScale
REF_1030
TMP_1329
div_
TMP_272
newAdmin
TMP_403
BridgeManager/recipient
TMP_405
TMP_406
BridgeManager/zero
locked
TMP_407
tokenAddr
ethToken
TMP_408
TMP_409
'TMP_408'
_balanceBefore
TMP_410
'ethToken'
'TMP_410'
TMP_412
TMP_413
'TMP_412'
_balanceAfter
TMP_414
'_balanceAfter'
'_balanceBefore'
_actualAmount
TMP_415
Locked
divide
REF_39
withdrawnDividends
_account
REF_40
TMP_277
'REF_40'
'_amount'
->withdrawnDividends
REF_168
TMP_203
TMP_204
REF_37
TMP_205
'REF_38'
'subtractedValue'
decreased
below
zero'
TMP_108
BlueskySwap
delegateAndReturn
immutableOwner
_immutableOwner
TMP_195
epoch
currentEpoch
TMP_196
Bet
earlylate
TMP_197
Prediction
_bettable
bettable
minBetAmount
REF_58
BetInfo
ledger
REF_59
REF_60
alreadybet
REF_61
Round
rounds
round
REF_62
bullAmount
REF_63
->round
refereeAmt
referrerAmt
stakingAmt
treasuryRate
TOTAL_RATE
treasuryAmt
TMP_206
referralSystem
IReferral
hasReferrer
'user'
TMP_207
refereeRate
TMP_208
100
TMP_209
referrerRate
TMP_210
REF_65
bullBonusAmount
REF_66
TMP_211
TMP_212
TMP_213
staker
IStaker
getUserStakingLevel
stakingLvl
REF_68
stakingBonuses
TMP_214
REF_69
TMP_215
TMP_216
REF_70
TMP_217
TMP_218
REF_71
TMP_219
REF_73
treasuryAmount
REF_74
TMP_220
REF_75
betInfo
REF_77
Position
position
REF_78
Bull
->betInfo
REF_79
REF_80
refereeAmount
REF_81
referrerAmount
REF_82
stakingAmount
REF_83
TMP_221
PredictionsBet
ReentrancyGuard
nonReentrant
TMP_122
LiquidityGeneratorToken
REF_207
REF_208
TMP_453
'REF_208'
TMP_2204
TMP_63
TMP_64
TMP_2348
targetLiquidity
_target
targetLiquidityDenominator
_denominator
authorized
TUPLE_1
weiValue
returndata_size__functionCallWithValue_asm_0
'TMP_6'
REF_6
TRANSFER_FAILED
Double
functionDelegateCall
gas
result_executeCall_asm_0
switch_expr_8404_156_0_executeCall_asm_0
returndatasize
size_executeCall_asm_0
64
ptr_executeCall_asm_0
returndatacopy
REF_50
REF_51
REF_41
user2vesting
_user
REF_42
_id
TMP_119
REF_43
Vesting
Vest
vestings
_claimable
_RESERVE
daoFee
'BASE'
'TMP_210'
'TMP_212'
TUPLE_4
ECDSA
RecoverError
tryRecover
hash
r
vs
recovered
error
_throwError
0x00
temp
length
>>
8
Strings
toHexString
TMP_296
TMP_297
TUPLE_11
addLiquidityETH
'TMP_299'
'TMP_300'
ethAmount
AntiBotStandardToken
REF_23
'REF_24'
Counters
Counter
_nonces
TMP_266
current
'REF_95'
'd'
BurnableToken
isAuthorized
!AUTHORIZED
product
truncate
add_
addend
Alicia
TMP_639
TMP_640
_feeAddress
TMP_641
setFeeAddress
invalid
TMP_642
feeAddress
TMP_643
FORBIDDEN
REF_33
doubleScale
_getValues
4
tCharity
_tOwned
TMP_166
'REF_59'
'tAmount'
->_tOwned
TMP_167
'REF_62'
'rAmount'
->_rOwned
REF_64
TMP_168
'REF_65'
'tTransferAmount'
REF_67
TMP_169
'REF_68'
'rTransferAmount'
_takeLiquidity
_takeCharityFee
_reflectFee
_INITIALIZED_
_OWNER_
notInitialized
REF_20
REF_21
Caller
REF_46
Set
_inner
_length
TMP_801
ODelegator
delegateTo
_removeMinter
TMP_267
TMP_268
TMP_269
TMP_270
ERC721
_exists
tokenId
TMP_123
operator
query
nonexistent
ownerOf
getApproved
isApprovedForAll
REF_9
TMP_183
TMP_184
TMP_185
TMP_186
TMP_187
uint16
65535
SafeCast
doesn't
fit
in
bits
result
WAD
n
wmul
TMP_496
TMP_497
TMP_498
keccak256
TMP_499
POWEREVOC
getChainId
TMP_500
TMP_501
encode
DOMAIN_TYPEHASH
TMP_502
domainSeparator
TMP_503
DELEGATION_TYPEHASH
delegatee
nonce
expiry
TMP_504
structHash
TMP_505
encodePacked

TMP_506
digest
TMP_507
ecrecover
v
s
signatory
TMP_508
TMP_509
TMP_510
TOKEN
delegateBySig
signature
nonces
TMP_511
TMP_512
TMP_513
TMP_514
TMP_515
expired
TMP_516
REF_212
tokenHoldersMap
keys
REF_213
TMP_152
TMP_153
TMP_154
TMP_155
TMP_156
TMP_157
TMP_160
115792089237316195423570985008687907853269984665640564039457584007913129639935
CONNECTORCOIN
Unpaused
whenPaused
TMP_578
TMP_579
TMP_580
TMP_581
cashout
REF_319
_isBlacklisted
TMP_582
TMP_583
Blacklisted
TMP_140
'TMP_140'
TMP_142
TMP_143
TMP_144
TMP_145
TUPLE_9
Exponential
mulScalar
err
name_
symbol_
TMP_102
TMP_103
TMP_104
ApproveAndCallFallBack
TMP_105
receiveApproval
'TMP_105'
'extraData'
Unauthorized
BOGAuth
TMP_864
TMP_865
_beneficiaryFeeRate
ROCNFTMarket
feeRate
must
be
less
than
beneficiaryFeeRate
BeneficiaryFeeRateChanged
tx
origin
sorry
humans
only
adminAddress
Only
remaining
BONUS_POOL_LEADERBOARD_MIN_STAKE_TO_MAINTAIN_POSITION
maxPositions
REF_48
_bonusPoolLeaderboardPositionsCount
stakeholder
REF_49
TMP_273
positionsToKick
GreenHouse
_bonusPoolLeaderboardKick
TMP_118
decreaseApproval
TMP_484
TMP_485
comptroller
ComptrollerInterface
mintAllowed
'TMP_484'
'minter'
'mintAmount'
TMP_486
REF_270
COMPTROLLER_REJECTION
REF_271
MINT_COMPTROLLER_REJECTION
TMP_487
failOpaque
TMP_488
TMP_489
REF_272
REF_273
MINT_FRESHNESS_CHECK
TMP_490
REF_274
vars
mathErr
REF_275
exchangeRateMantissa
TUPLE_64
exchangeRateStoredInternal
REF_276
REF_277
TMP_491
REF_278
MATH_ERROR
REF_279
MINT_EXCHANGE_RATE_READ_FAILED
REF_280
TMP_492
REF_281
actualMintAmount
doTransferIn
minter
mintAmount
->vars
REF_282
REF_283
mintTokens
REF_284
REF_285
TUPLE_65
divScalarByExpTruncate
REF_286
REF_287
MINT_EXCHANGE_CALCULATION_FAILED
REF_288
REF_289
totalSupplyNew
REF_290
TUPLE_66
addUInt
totalSupply
REF_291
REF_292
MINT_NEW_TOTAL_SUPPLY_CALCULATION_FAILED
REF_293
REF_294
accountTokensNew
REF_295
accountTokens
REF_296
TUPLE_67
REF_297
REF_298
MINT_NEW_ACCOUNT_BALANCE_CALCULATION_FAILED
REF_299
REF_300
REF_301
->accountTokens
REF_302
REF_303
Mint
REF_304
REF_306
REF_307
mintVerify
'TMP_505'
'REF_306'
'REF_307'
REF_308
REF_309
TMP_146
Token
_isExcludedFromFee
->_isExcludedFromFee
'TMP_41'
TMP_180
TMP_181
TMP_182
TMP_62
OwnershipTransferPrepared
_NEW_OWNER_
multiplier_
supply_
msgSender
REF_7
REF_8
subtractedValue
REF_98
_contains
REF_10
addedValue
TMP_171
TMP_172
ALUVault
withdraw
transferOwner
57896044618658097711785492504343953926418782139537452191302581570759080747168
InvalidSignatureS
27
28
REF_36
InvalidSignatureV
signer
TMP_109
TMP_111
InvalidSignature
NoError
calldatasize
calldatacopy
TMP_232
result__delegate_asm_0
switch_expr_21523_164_0__delegate_asm_0
TMP_238
TMP_239
TMP_240
TMP_241
return
'REF_50'
TMP_278
TMP_279
TMP_280
TMP_281
TMP_282
TMP_283
TMP_284
TMP_285
LPC
TMP_149
richTokenAddress
TMP_150
_cakeTokenAddress
cakeToken
_randomGeneratorAddress
IRandomNumberGenerator
randomGenerator
uint32
_bracketCalculator
->_bracketCalculator
REF_28
11
111
1111
11111
111111
_status
_NOT_ENTERED
_previousOwner
time
_lockTime
TMP_304
_mintingAddress
Can
change
newAddress
epochs
REF_90
Timestamps
timestamps
startTimestamp
closeTimestamp
addedReward
REF_101
oracleCalled
REF_102
claimable
No
REF_103
REF_104
REF_105
REF_106
rewardAmount
REF_107
rewardBaseCalAmount
REF_108
REF_109
TMP_242
REF_110
TMP_243
TMP_244
getReferrer
referrerUser
REF_112
userReferenceBonuses
REF_113
REF_114
TMP_245
->userReferenceBonuses
REF_115
totalUserReferenceBonuses
REF_116
REF_117
TMP_246
->totalUserReferenceBonuses
REF_118
REF_119
PredictionsReferrerBonus
REF_120
refundable
refund
REF_121
REF_122
claimed
reward
REF_123
PredictionsClaim
'betToken'
'reward'
TMP_163
ShibHood
_transferFrom
busd
1335364322635977212851319375275419397007052668246
SmartChefInitializable
pancakeProfileIsRequested
pancakeProfileThresholdPoints
pancakeProfile
IPancakeProfile
getUserStatus
Deposit
Must
an
active
profile
numberUserPoints
TUPLE_5
getUserProfile
User
has
enough
points
TMP_113
hasUserLimit
userLimit
TMP_114
TMP_116
poolLimitPerUser
TMP_117
Amount
above
limit
_updatePool
TMP_121
accTokenPerShare
PRECISION_FACTOR
pending
'rewardToken'
'TMP_125'
'pending'
'stakedToken'
'TMP_129'
'TMP_130'
'TMP_156'
'REF_33'
'BEP20
sub_
underflow
GOV_HUB_ADDR
message
governance
INVALID_CLAIM
Authorized
counter
'REF_10'
Ethereum
Signed
Message
_token
_router
IRouter
router
96635033217071433185869069577301221175488545358
1000000000
_tTotal
MAX
Galaxy
Heroes
Coin
GHC
swapAndLiquifycount
snipersCaught
_taxFee
_previousTaxFee
_liquidityFee
_previousLiquidityFee
div1
div2
33
30
_intervalSecondsForSwap
TMP_411
20000000
_maxWallet
5000000
_maxTxAmount
TMP_418
TMP_419
2500000
TMP_420
TMP_421
minimumTokensBeforeSwap
launchedAt
sniperProtection
_hasLiqBeenAdded
_tradingEnabled
TMP_422
42792930790509733803510649550163648224098346427
buybackAddress
TMP_423
96363520129238751096034398148879996806845593913
devAddress
TMP_424
810315944490942918158799676875000069107196332020
lpAddress
TMP_425
546286755401474484267420695216757468924120151410
stakingAddress
_transferTaxRate
transferTaxRate
pair
inSwap
swapEnabled
swapThreshold
'TMP_100'
'TMP_101'
'value'
newAllowance
REF_25
shareholderIndexes
shareholders
->shareholderIndexes
->shareholders
ST_Basic_Token
REF_19
IST20
'REF_39'
_at
TMP_164
TMP_165
TMP_170
TMP_174
TMP_175
getCashPrior
getSupplyRate
'TMP_416'
'totalBorrows'
'totalReserves'
'reserveFactorMantissa'
ERC20Votes
Checkpoint
_checkpoints
toUint32
'REF_130'
typeHash
nameHash
versionHash
chainid
TMP_921
_SETTLED_
NOT_SETTLED
olaReserveFactorMantissa
MIN_INT256
&
REF_45
TMP_577
_ENTERED
reentrant
PancakePair
IPair
uint112
getReserves
_reserve0
_reserve1
WETHAmount
TOKENAmount
token0
PancakeV2Router
'TMP_70'
'TMP_17'
'TMP_18'
TMP_587
SWAP_AND_LIQUIFY_DISABLED
SWAP_AND_LIQUIFY_ENABLED
IN_SWAP_AND_LIQUIFY
_mining
claimBalance
MinerFactory
getMyMined
Miner
Sys
sys
'REF_0'
'TMP_20'
REF_198
periodFinish
_remaining
rewardRate
TMP_397
PausableUpgradeable
TMP_398
340282366920938463463374607431768211456
uint128
number
aFreeAddr
_address
Manager
isGover
League
leagues
REF_47
Invalid
league
Id
->leagues
_league
sport
LeagueUpdated
AccessProtected
TMP_312
takeFee
removeAllFee
_isExcluded
_transferFromExcluded
REF_137
_transferToExcluded
REF_138
REF_139
TMP_321
_transferStandard
REF_140
REF_141
_transferBothExcluded
restoreAllFee
^
Piggy
Bank
Machine
HAM
_limitSupply
1000000000000000
REF_164
TMP_308
TMP_309
TMP_291
TMP_292
TMP_293
TMP_294
1150544047710445019627523863049599657316801625194
TMP_295
swapExactTokensForTokensSupportingFeeOnTransferTokens
'TMP_295'
Permit
_PERMIT_TYPEHASH
'REF_31'
'_addedValue'
_thresholdPoints
Threshold
need
exceed
_isRequested
UpdateProfileAndThresholdPointsRequirement
Can't
unauthorize
permissionNameToIndex
permissionName
permIndex
REF_54
REF_55
UnauthorizedFor
REF_56
Permission
Unauthorize
RSunAuth
authorizedFor
TMP_787
ComptrollerForOToken
TMP_789
adminBankAddress
TMP_1682
bytes30
Account
already
included
REF_209
REF_210
reflectionFromToken
REF_211
_tIncludedInReward
REF_214
->_isExcludedFromReward
TMP_686
zeroAddress
NOT_ZERO_ADDRESS
EnumerableMap
Map
map
key
_get
uint160
lockAccount
now
lock
'REF_29'
TMP_2320
TMP_810
feeToAddress
TMP_811
_feeSize
AbstractDeflationaryAutoLPToken
_tokenTransfer
feeBeneficiary
ignoreBalance
inserted
values
->map
val
REF_18
indexOf
REF_22
increaseApproval
_addedValue
TMP_1440
lToken
TMP_1441
LendHubChainlinkOracle
compareStrings
baseSymbol
TMP_1442
AggregatorV2V3Interface
getFeed
TMP_1443
getChainlinkPrice
TMP_1444
LHB
TMP_1445
REF_1061
prices
TMP_1446
getPrice
accountHash
89477152217924674838424037953991966239322087453347756267410168184682657981552
extcodehash
codehash
shareholderTotalDividends
shareholderTotalExcluded
'shareholderTotalDividends'
'shareholderTotalExcluded'
LGEWhitelisted
_transferWhitelister
newWhitelister
onlyWhitelister
marketAddress
market
TMP_366
MarketToken
TUPLE_44
getAccountSnapshot
'borrower'
gTokenBalance
exchangeRate
TMP_367
TMP_368
oracle
PriceOracle
TMP_369
TMP_370
getUnderlyingPrice
'TMP_369'
price
REF_191
marketTokenSupplied
TMP_371
TUPLE_45
mulScalarTruncate
REF_192
TMP_372
TUPLE_46
marketTokenSuppliedInBnb
_unlocked
voter
Voter
distribute
'TMP_109'
rewardPerTokenStored
lastUpdateTime
Gauge
_updateRewardPerToken
earned
_reward
lastEarn
->lastEarn
userRewardPerTokenStored
->userRewardPerTokenStored
_safeTransfer
ClaimRewards
exp
Hedge_T2K_Bond
getCurrentPhase
phase
hedge_bonded_per_phase
total
self
_x
RESOLUTION
uint144
57005
PauserRole
isPauser
digits
buffer
bytes1
48
->buffer
'REF_41'
'Insufficient
Balance'
REF_44
'REF_44'
'REF_7'
TMP_616
TMP_617
TMP_618
TMP_619
TMP_620
TMP_621
senderBalance
TMP_623
TMP_624
TMP_625
borrowRateMaxMantissa
5000000000000
reserveFactorMaxMantissa
1000000000000000000
protocolSeizeShareMantissa
28000000000000000
isGToken
_FREEZE_TIMESTAMP_
DPPAdvancedAdmin
notFreezed
TMP_649
CPVesting
getClaimableLPToken
lpAmount
TMP_650
_POOL_
'TMP_650'
'_OWNER_'
'lpAmount'
ClaimLP
afterFreeze
PacocaFarm
updatePool
REF_166
REF_167
REF_169
REF_170
strat
TMP_307
IStrategy
wantLockedTotal
TMP_310
sharesTotal
TMP_311
TMP_313
accPACOCAPerShare
'REF_176'
'REF_178'
'TMP_315'
'1000000000000'
'TMP_316'
'REF_181'
safePACOCATransfer
'REF_182'
'wantLockedTotal'
'TMP_320'
'sharesTotal'
_wantAmt
REF_185
REF_186
'_wantAmt'
sharesRemoved
REF_188
REF_189
REF_190
'REF_191'
'sharesRemoved'
REF_193
want
'TMP_329'
wantBal
REF_195
'REF_195'
'TMP_332'
REF_197
'REF_198'
'TMP_334'
Withdraw
remove
'_whitelisteds'
WhitelistedRemoved
'TMP_5'
_REGISTRY_
baseToken
quoteToken
registryList
->registryList
->_REGISTRY_
REF_57
delete
_USER_REGISTRY_
creator
userRegistryList
i_scope_0
->userRegistryList
->_USER_REGISTRY_
RemoveDVM
BabyDragoToken
TMP_2401
TMP_2402
_blackList
listAddress
isBlackListed
_transferToken
Registry
getReqBytes
IRegistry
Request
_hashedReqs
TMP_517
TMP_518
Reg
request
same
ContextUpgradeable
__Context_init_unchained
ERC20Upgradeable
__ERC20_init_unchained
Initializable
initializer
->counter
TMP_290
that
own
_owners
->_owners
TMP_176
TMP_177
TMP_178
_impl
_delegates
delegator
TMP_151
totalDistributed
LiqStatus
57896044618658097711785492504343953926634992332820282019728792003956564819967
255
TMP_193
TMP_644
TMP_645
TMP_646
'_gonsPerFragment'
gonAmount
_gonBalances
'REF_28'
'gonAmount'
->_gonBalances
antiBotEnabled
pinkAntiBot
IPinkAntiBot
onPreTransferCheck
'from'
'to'
TMP_263
TMP_264
TMP_265
Failed
retrieve
BNB
contains
AddressSet
TMP_391
'TMP_392'
_contractBalance
TMP_395
'_to'
'_contractBalance'
_sent
_checkOnERC721Received
_data
k020
TUPLE_12
TMP_191
TMP_192
quotient
remainder
'REF_13'
'REF_16'
_upgradeTo
_pause
total_users
total_deposited
total_withdraw
total_bnb
total_txs
total_airdrops
treasuryPercentage
_percent
acceptPayTokens
_payToken
->acceptPayTokens
_accept
_isAuth
->_isAuth
TMP_257
TMP_259
TMP_260
TMP_261
IMPLEMENTATION_SLOT
50801780122331352337026042894847907698553222651959119521779622085092237899971
ADMIN_SLOT
7616251639890160809447714111544359812065171195189364993079081710756264753419
ApeLibrary
'token'
'WETH'
IApePair
permit
'TMP_179'
'deadline'
'v'
'r'
's'
ApeRouter
removeLiquidityETHSupportingFeeOnTransferTokens
amountTokenMin
amountETHMin
amountETH
approveMax
_remove
TMP_1162
TMP_1163
TUPLE_143
mulExp
'REF_66'
chainID
TMP_188
EIP712Domain
version
chainId
verifyingContract
TMP_189
TMP_190
DOMAIN_SEPARATOR
DelegateERC20
_moveDelegates
TMP_147
TMP_148
getUnpaidEarnings
'totalDistributed'
RWRD
'shareholder'
shareholderClaims
->shareholderClaims
totalRealised
'REF_45'
TMP_396
TMP_399
REF_88
REF_235
FaucetV4
users
_addr
REF_236
referrals
REF_237
REF_238
deposits
REF_239
REF_240
payouts
REF_241
REF_242
total_structure
REF_243
Airdrop
airdrops
REF_244
REF_245
airdrops_received
TMP_2098
tradingOpen
liquidityFeeBps
bps
'_brcrTotal'
'brcrFee'
_brcrTotal
'_brctFeeTotal'
'tFee'
_brctFeeTotal
_ROLLBACK_SLOT
33048860383849004559742813297059419343339852917517107368639918720169455489347
_BEACON_SLOT
74152234768234802001998023604048924213078445070507226371336425913862612794704
Excluded
cannot
'REF_27'
'_rTotal'
'_tFeeTotal'
TMP_466
TMP_467
HashedReqCancelled
initEthSent
TMP_469
verReq
set_
valueToInsert_
_insert
index_
RWDS
TMP_449
TMP_450
PERMIT_TYPEHASH
TMP_451
_blackHole
'TMP_44'
balanceBefore
WBNB
IDEXRouter
swapExactETHForTokensSupportingFeeOnTransferTokens
'TMP_49'
'TMP_51'
'TMP_52'
'balanceBefore'
'totalDividends'
totalDividends
'TMP_55'
'totalShares'
'TMP_56'
dividendsPerShare
src
transferAllowances
REF_215
->transferAllowances
InvalidSignatureLength
_inSwapAndLiquify
coinbase
producer
_auction
duration
60
ClockAuctionBase
Auction
tokenIdToAuction
_tokenId
->tokenIdToAuction
startingPrice
endingPrice
AuctionCreated
item
len
count
memPtr
RLPDecode
_payloadOffset
currPtr
endPtr
_itemLength
sendGasMin
balances
'REF_114'
'REF_117'
ThreeYearsStakingContract
getClaimableRewards
toClaim
Nothing
STAKING_TOKEN
'TMP_62'
totalStaked
Insuficient
'toClaim'
_updateLastClaim
Claimed
RLPItem
nextPtr
REF_85
_evilUser
->_blackList
LogBlackListChanged
REF_86
REF_184
'REF_71'
TMP_2194
'TMP_47'
'TMP_50'
'TMP_53'
'TMP_54'
_indexes
MinterRemoved
_verifyCallResult
keyIndex
toDeleteIndex
MapEntry
_entries
lastIndex
lastEntry
_key
REF_84
SHOOD
TMP_339
TMP_349
initialExchangeRateMantissa
TMP_350
totalCash
TUPLE_54
addThenSubUInt
totalBorrows
totalReserves
cashPlusBorrowsMinusReserves
TMP_351
TUPLE_55
getExp
TMP_352
TMP_1672
bytes25
_guardCounter
localCounter
TMP_338
calculateTaxFee
brctAmount
brctFee
calculateLiquidityFee
brctLiquidity
TMP_340
'brctAmount'
'brctFee'
TMP_341
'TMP_340'
'brctLiquidity'
TMP_274
'magnifiedDividendPerShare'
TMP_275
SafeMathUint
toInt256Safe
'TMP_274'
_magCorrection
magnifiedDividendCorrections
TMP_276
SafeMathInt
'REF_77'
'_magCorrection'
->magnifiedDividendCorrections
'REF_80'
128
MAGNITUDE
FEE_ALL_USERS_STAKED_PERMILLE
700
FEE_BONUS_POOL_PERMILLE
FEE_PLATFORM_WALLET_PERMILLE
TOKEN_DECIMAL
FEE_REFERRAL_PERMILLE
50
FEE_PARTNER_WALLET_PERMILLE
MONTHLY_POOL_DISTRIBUTE_ALL_USERS_PERCENT
MONYHLY_POOL_TIMER
2592000
BONUS_POOL_DISTRIBUTE_ALL_USERS_PERCENT
40
BONUS_POOL_DISTRIBUTE_LEADERBOARD_PERCENT
BONUS_POOL_LEADERBOARD_MAX_USERS_COUNT
BONUS_POOL_LEADERBOARD_MIN_STAKE_TO_QUALIFY
1000
900
BONUS_POOL_NEW_STAKEHOLDER_TIME_ADDITION
BONUS_POOL_TIMER_INITIAL
21600
eip1967
proxy
_logic
'_data'
TMP_222
TMP_223
TMP_224
swapTokensAtAmount
newValue
init
done
TRDCvault
CardThief
cardThief
thiefIndex
->cardThief
_TIMELOCK_DURATION_
_TIMELOCK_
newDodoProxy
TMP_637
TMP_638
TMP_647
BUSD
daoClaim
_daoClaim
_daoFee
running
_running
cancelPeriod
_cancelPeriod
Dao
onlyDAO
Access
contractCallable
non
TMP_162
TUPLE_32
mulUInt
numerator
TMP_254
divisor
TUPLE_33
TMP_1980
_ve
ve
rewardToken
isReward
withdrawReward
stake
tokenIds
Incorrect
ID
->tokenIds
detachTokenFromGauge
'tokenId'
REF_194
derivedBalances
_derivedBalance
derivedSupply
derivedBalance
->derivedBalances
REF_196
_writeCheckpoint
_writeSupplyCheckpoint
emitWithdraw
TMP_346
TMP_347
Insufficient
authority
REF_205
->lockAccount
lockenddate
isOwner
Ownership
required
REF_153
TMP_286
You
don't
permission
unlock
Contract
until
7
days
TMP_471
TMP_472
Delegation
TMP_342
TMP_343
TMP_344
minTokenBeforeSendDividend
newAmount
BasicToken
wards
TokenManager/not-authorized
'REF_23'
brctTransferAmount
_getBrcRValues
brcrAmount
brcrTransferAmount
brcrFee
_CACHED_CHAIN_ID
_CACHED_DOMAIN_SEPARATOR
EIP712
_buildDomainSeparator
_TYPE_HASH
_HASHED_NAME
_HASHED_VERSION
TMP_1264
TMP_1265
TUPLE_145
_adminList
_masert
onlyMasert
implementationPosition
'TMP_29'
TUPLE_6
ErrorReporter
_whitelister
whitelister
ERC20Snapshot
_valueAt
Snapshots
snapshotId
_totalSupplySnapshots
snapshotted
_WHITELIST_MODE_ON_
'_logic'
'TMP_419'
'TMP_82'
TMP_287
IERC721Receiver
353073666
TMP_288
TMP_289
'TMP_289'
'ERC721
ERC721Receiver
implementer'
bytes4
retval
_ERC721_RECEIVED
'TMP_139'
_from
'_value'
->balances
'REF_32'
'REF_37'
vault
_vault
bFreeAddr
mstore
115792089237316195423570985008687907853269984665640564039439137263839420088320
115792089237316195423570985008687907852929702298719625575994209400481361428480
rs
_add
accumulativeDividendOf
'TMP_265'
'REF_67'
blockNumber
yet
mined
_checkpointsLookup
_totalSupplyCheckpoints
IterableMapping
'tokenHoldersMap'
dividendToken
newToken
INTEGER_OVERFLOW
TMP_161
'TMP_58'
rewardTokenInfos
BaseMine
RewardTokenInfo
rewardVault
DODOMineV3
TOKEN_NOT_FOUND
ALLOWANCE_NOT_ENOUGH
CustomERC20
FNum
bmul
BASE
LibCoreStorage
CoreStorage
coreStorage
->TMP_19
ProxyPausable
ProxyOwnable
minters
!minter
_want
safeApprove
'TMP_644'
'_chef'
'TMP_646'
TMP_648
_output
'TMP_648'
'_unirouter'
TMP_652
_lpToken0
'TMP_652'
TMP_654
TMP_655
TMP_656
'TMP_654'
'TMP_656'
TMP_658
_lpToken1
'TMP_658'
TMP_660
TMP_661
TMP_662
'TMP_660'
'TMP_662'
VALIDATOR_CONTRACT_ADDR
validatorSet
_balance
amt
bsub
->_balance
wADABoySTAKEGen0
_stakeNFT
newRouter
IPancakeRouter02
updatedRouter
pancakeRouter
MOSToken
REF_221
cTokenBalance
TUPLE_48
borrowBalanceStoredInternal
mErr
borrowBalance
REF_222
REF_223
TUPLE_49
REF_224
REF_225
REF_226
NOT_OWNER
'TMP_59'
rewardAddr
_presaleLocked
_presaleLockedAmount
_nextUnlockAt
TMP_345
_lastUnlockAt
_latestUnlockRound
TMP_348
TMP_353
2531250
1000000
unlockAmount
TMP_354
TMP_355
TMP_356
TMP_357
1906250
TMP_358
TMP_359
TMP_360
TMP_361
2031250
TMP_362
13
TMP_363
TMP_364
TMP_365
1531250
31
59
1406250
95
TMP_373
706250
TMP_374
96
TMP_375
119
TMP_376
TMP_377
550000
TMP_378
TMP_379
TMP_380
TMP_381
funds
'REF_70'
'REF_73'
_swapTokensAtAmount
TMP_473
borrowAllowed
'TMP_472'
'borrowAmount'
TMP_474
REF_344
REF_345
BORROW_COMPTROLLER_REJECTION
TMP_475
TMP_476
TMP_477
REF_346
REF_347
BORROW_FRESHNESS_CHECK
TMP_478
TMP_479
TMP_480
borrowAmount
REF_348
TOKEN_INSUFFICIENT_CASH
REF_349
BORROW_CASH_NOT_AVAILABLE
TMP_481
REF_350
REF_351
accountBorrows
TUPLE_72
borrower
REF_352
REF_353
TMP_482
REF_354
REF_355
BORROW_ACCUMULATED_BALANCE_CALCULATION_FAILED
REF_356
TMP_483
REF_357
REF_358
accountBorrowsNew
REF_359
TUPLE_73
REF_360
REF_361
REF_362
REF_363
BORROW_NEW_ACCOUNT_BORROW_BALANCE_CALCULATION_FAILED
REF_364
REF_365
REF_366
totalBorrowsNew
TUPLE_74
REF_367
REF_368
REF_369
REF_370
BORROW_NEW_TOTAL_BALANCE_CALCULATION_FAILED
REF_371
doTransferOut
REF_372
CTokenStorage
BorrowSnapshot
REF_373
principal
REF_374
->accountBorrows
REF_375
REF_376
interestIndex
borrowIndex
REF_377
REF_378
REF_379
Borrow
borrowVerify
'TMP_493'
REF_381
TxRule
UserStruct
exUpdateAccSushiLp
accSushiLp
'allTotalRewardLp'
'lastTotalRewardLp'
_totalRed
'_totalRed'
totalValidBalanceLp
'TMP_294'
'totalAccSushiLp'
'TMP_296'
_nowSushi
TMP_298
lpTokenContract
ERC20Basic
'_user'
'_nowSushi'
'REF_140'
'TMP_298'
_userRed
cakeToken2
'_userRed'
curRewardLp
'REF_144'
REF_146
totalAccSushiLp
lastTotalRewardLp
allTotalRewardLp
_isExcludedFromAntiWhale
->_isExcludedFromAntiWhale
'magnitude'
magnifiedDividendPerShare
isComptroller
tokenManager
TokenManager
addToken
'tokenAddr'
'name'
'symbol'
'decimals'
oneTokenAddr
mappings
->mappings
usedEvents_
receiptId
TMP_426
TMP_427
HmyManager/The
event
reused
->usedEvents_
TMP_428
MintableToken
TMP_429
'recipient'
Minted
BridgeManager
onlyWallet
'REF_20'
'REF_58'
TMP_400
REF_147
REF_148
REF_149
REF_150
nextMintingAt
1638090000
120
_mintingDates
->_mintingDates
mintingAmount
_mintingAmounts
->_mintingAmounts
_remainingMintingAmount
mintingAmount_scope_0
mintingAmount_scope_1
mintingAmount_scope_2
mintingAmount_scope_3
mintingAmount_scope_4
mintingAmount_scope_5
TMP_2290
'TMP_146'
'TMP_147'
REF_154
REF_155
'REF_155'
REF_157
REF_158
'REF_158'
account_
ammount_
'ammount_'
'REF_36'
_defaultOperatorsArray
defaultOperators_
_defaultOperators
->_defaultOperators
ERC777Token
_ERC1820_REGISTRY
IERC1820Registry
setInterfaceImplementer
'TMP_200'
'TMP_201'
ERC20Token
'TMP_204'
'TMP_205'
'TMP_206'
minPeriod
_minPeriod
minDistribution
_minDistribution
DDStakingPool
StrategyCommonChefLP
harvest
GasThrottler
gasThrottle
exchangeRateCurrent
REF_219
TUPLE_47
REF_220
could
calculated
auction
TMP_593
_isOnAuction
TMP_594
TokenID
on
seller
_cancelAuction
swapStats
TMP_437
TMP_438
_feeTo
TMP_439
'_feeTo'
TMP_440
TMP_441
TMP_442
fee
can
or
feeTo
isWhiteList
->isWhiteList
TUPLE_53
exchangeRateStored
DIVIDING_ERROR
onlyCaller
_newCaller
TMP_818
TMP_819
fallback
TUPLE_89
data'
restricted
_DODO_APPROVE_
IDODOApprove
claimTokens
'who'
'dest'
_recipient
CryptoDrop
Staking
'TMP_319'
WithdrawToken
'TMP_324'
'TMP_322'
'_recipient'
'TMP_325'
isCToken
1000000000000000000000000000000000000
TMP_1299
halfExpScale
mantissaOne
_newOwner
pull
OwnershipPulled
ds-math-sub-underflow
REF_142
Fee
'_liquidityFee'
'_externalFee'
_totalLiquidityFee
Unpause
PermittableToken
transferFrom
!OWNER
TMP_382
TMP_383
TMP_384
pcsV2Router
TMP_385
TMP_386
'TMP_388'
CANCEL_COOLDOWN_TIME
86400
currentRate
'tLiquidity'
'currentRate'
rLiquidity
TMP_262
'REF_110'
'rLiquidity'
PredictionStaker
stakingInfo
userStakeInfo
NAME
fundAddress
lastProcessedIndex
calculateCharityFee
tCharityFee
'TMP_198'
'TMP_199'
'tCharityFee'
teamRate
_lv
enabled
bond_start
'TMP_64'
oldAllowance
ERC1271_MAGICVALUE_BYTES32
371636862
implementer
'REF_8'
'_pausers'
PauserRemoved
automatedMarketMakerPairs
pairaddress
->automatedMarketMakerPairs
initOwner
_DODO_LIMIT_ORDER_
dodoLimitOrder
_TOKEN_RECEIVER_
tokenReceiver
dodoApprove
PetAccessControl
TMP_2170
TMP_1191
TMP_1192
TMP_1193
reflections
TMP_2282
addr
enable
BISTRO
partnershipPercentage
percent_
partnershipWallet
wallet_
usdt
'TMP_30'
usdtBalance
token520
'TMP_33'
'usdtBalance'
'TMP_35'
token520Balance
'TMP_38'
'token520Balance'
TUPLE_14
REF_156
'REF_156'
REF_159
'REF_159'
REF_162
'REF_162'
TMP_539
enableAntiBot
_enable
REF_1078
asset
PricePosted
REF_1079
->prices
_lgeTimestamp
wlCloseTimestampLast
_lgeWhitelistRounds
WhitelistRound
wlRound
'wlCloseTimestampLast'
'REF_57'
'i'
'1'
amountMax
purchased
861603356937639158942115754849381155388626371637
_futurUseSellFee
mapPID_address
_proposalID
_proposedAddress
iROUTER
_ROUTER
_until
FreezableToken
toKey
parentKey
chains
next
->chains
nextKey
parent
REF_310
REF_311
REF_312
->_lgeWhitelistRounds
role
bearer
->role
'REF_55'
'REF_26'
MAXSUPPLY
MCCNodeRewards
share
_getTotalNumberClaims
availableClaims
IMCCNode
tokenPerDayReturn
'_tokenId'
perDayTokens
'perDayTokens'
'remainingClaims'
lastClaim
remainingClaims
'REF_15'
'TMP_71'
'rewardFrequencySeconds'
distributeDividend
removeShareholder
'TMP_61'
TMP_694
MUL_ERROR
contractOwner
RouterProxy
onlyContractOwner
Dividend_Tracker
withdrawDividend
disabled
Use
'claim'
main
isExcludedFromDividends
TMP_457
tracker
DragoTracker
REF_124
'_from'
TMP_460
HashedReqUnveriCancelled
REF_183
_hashedReqsUnveri
verReqIPFS
dataPrefix
dataSuffix
TMP_590
_DELEGATION_TYPEHASH
_claimingTimestamp
sload
adm
150000000
maxBuy
300000000000000000000
maxSell
150000000000000000000
buyCooldown
sellCooldown
dividendFee
tranAmount
nftWhites
buyRateList
pBuyRate
'TMP_84'
'TMP_85'
'10000'
sellRate2
'TMP_87'
'TMP_88'
freeAAmount
fireStoreAddr
IFireStore
buyAAddreTokenAdd
'freeAAmount'
'REF_43'
'sellRate2'
'TMP_94'
freeBAmount
fireBaseFuncAddr
'REF_48'
'freeBAmount'
IFireBaseFunc
autoBuySellToken
sellRateList
pSellRate
'pSellRate'
'TMP_104'
freeBAmount_scope_0
'freeBAmount_scope_0'
autoSellSellToken
'tranAmount'
PetBase
Pet
pets
_matronId
matron
birthTime
TMP_982
TMP_983
pet
TMP_984
PetBreeding
_isReadyToGiveBirth
TMP_985
Not
ready
birth
siringWithId
sireId
sire
generation
parentGen
TMP_986
TMP_987
geneScience
IGeneScience
genes
cooldownEndBlock
TMP_988
TMP_989
mixGenes
'REF_296'
'REF_297'
'TMP_988'
childGenes
PetIndexToOwner
TMP_990
TMP_991
_createPet
petId
TMP_992
pregnantpets
TMP_1052
_generation
TMP_1053
cooldownIndex
TMP_1054
TMP_1055
TMP_1056
TMP_1057
_sireId
TMP_1058
TMP_1059
TMP_1060
_genes
_Pet
REF_316
TMP_1063
TMP_1064
->pets
REF_317
TMP_1062
TMP_1061
newpetId
REF_318
matronId
TMP_1065
TMP_1066
REF_320
Birth
TMP_1068
e7
ERC721Metadata
URI
_tokenURIs
->_tokenURIs
_tokenURI
_payoutStake
receipt
nftToken
IERC721
'TMP_97'
NftUnStaked
TUPLE_2
'TMP_12'
TRANSFER_FROM_FAILED
_stakeManager
StakeManager
manager
_DPP_
IDPP
ratioSync
!governance
_CKG
'TMP_83'
swapBNBForTokens
lockTheSwap
tokenFromReflection
_admins
->_admins
AdminAccessSet
INVALID_PATH
->amounts
amountOut
factory
reserveIn
reserveOut
getAmountIn
'REF_2'
TMP_1610
com_
useAdvancedRewardCalculation
sending
transData
->transData
_timestamp
maxSupply
100000000000000000000000000
PACOCAPerBlock
2000000000000000000
startBlock
totalAllocPoint
getFreezing
release
releaseOnce
_minimumNodeUseRef
nodeId
isPredictedByPool
prediction
poolId
Pool
Predicted
PoolPrediction
predictions
_predictionId
predictor
REF_216
matchIds
REF_217
REF_218
choices
isMatchExistsInPool
match
pools
REF_227
endTime
Pools
closed
REF_228
->predictions
REF_229
REF_230
REF_231
PredictionUpdated
_domainSeparatorV4
'_vVault'
'fractions'
vVault
_airdropEth
_swAirdrop
Transaction
recovery
_airdropToken
_refer
'_airdropToken'
'_referToken'
'TMP_123'
referToken
_referEth
_airdorpBnb
'_airdropEth'
'_referEth'
referEth
_allowedFragments
owner_
_tokenKeepingAddress
tokenKeepingAddress
TUPLE_25
keeper
_keeper
StratManager
onlyManager
'TMP_170'
'TMP_171'
ZeldaINU
getLiquidityBacking
accuracy
isFeeExempt
AnyswapV4ERC20
_deposit
onlyVault
UpgradeabilityOwnerStorage
upgradeabilityOwner
Claimable
claimNativeCoins
claimErc20Tokens
approved
_tokenApprovals
18446744073709551616
TMP_812
TMP_813
TMP_814
_currentPrice
SECONDS_PER_DAY
_days
dayOfWeek
cardCop
Cops
are
created
CardCop
cName
nameOfCop
cPower
powerOfCop
totalCops
ERC721Enumerable
k028
_allTokens
_approveAddress
externalAddress
rewardDistribution
distribution
REF_187
lastRewardBlock
->pool
REF_125
getMultiplier
multiplier
'multiplier'
'PACOCAPerBlock'
allocPoint
'TMP_262'
'REF_128'
'TMP_263'
'totalAllocPoint'
PACOCAReward
PACOCA
PACOCAToken
'PACOCAReward'
'ownerPACOCAReward'
'TMP_267'
'1000'
'TMP_266'
'TMP_268'
'TMP_271'
'TMP_273'
'REF_135'
info
Failure
opaqueError
sellFeeRate
rate
ChangeSellFeeRate
BAoE
impl
_BONDVAULT
iBONDVAULT
'bondAsset'
operational
weightChange
Pause
CdropToken
asFeature
sellMultiplier
Multiplier
_initialized
_initializing
isTopLevelCall
'REF_11'
'_subVal'
_onlyowner
newStatus
TMP_692
TMP_693
supply
deductTransferFee
_getFeesArray
fees
_getTransferAmount
'TMP_0'
APPROVE_FAILED
greater
TMP_306
maxTxAmount
dead
pcsV2Pair
contractBalanceRecepient
_maxWalletAmount
Exceeds
maximum
wallet
contractTokenBalance
numTokensSellToAddToLiquidity
overMinTokenBalance
inSwapAndLiquify
swapAndLiquify
_buybackFee
buyBackUpperLimit
'balance'
'100'
buyBackTokens
TMP_247
'TMP_247'
'TMP_248'
OwnableUpgradeable
hashedName
hashedVersion
_derived
_adjusted
erc20
_supply
balanceOfNFT
Math
min
'TMP_138'
'_balance'
staticcall
mintingFinished
MintFinished
canMint
burnAddress
ownerPACOCAReward
200
stakerAddressList
check
DIVTOKEN
'REF_61'
dividendTracker
DrivenDividendTracker
process
'gas'
iterations
claims
ProcessedDividendTracker
elements
transInAckPkg
bep2TokenSymbol
RLPEncode
encodeUint
->elements
refundAmount
'REF_84'
refundAddr
encodeAddress
'REF_87'
status
'TMP_336'
encodeList
'elements'
accrueInterest
TMP_430
accrue
interest
TMP_431
_POOLFACTORY
iPOOLFACTORY
getVaultAssets
votingAssets
_DAOVAULT
iDAOVAULT
mapTotalPool_balance
'REF_180'
lpTotal
mapPIDAsset_votes
_UTILS
iUTILS
getPoolShareWeight
'REF_184'
'REF_187'
_votedWeight
'REF_189'
'lpTotal'
_totalWeight
consensus
TMP_2356
GoldenDoge
'REF_30'
'REF_118'
'REF_121'
'REF_79'
BSCToken
TMP_225
TMP_2028
'REF_3'
'TMP_32'
->set
_excluded
->_excluded
->_isExcluded
112
Q112
5192296858534827628530496329220096
Q224
26959946667150639794667015087019630673637144422540572481103610249216
LOWER_MASK
5192296858534827628530496329220095
TMP_1854
TUPLE_15
divScalarByExp
fraction
_getCurrentSnapshotId
snapshots
ids
Arrays
findUpperBound
'REF_47'
'snapshotId'
TMP_557
TMP_558
TMP_559
TMP_560
native
'TMP_578'
'TMP_579'
'45'
'TMP_580'
nativeFees
transferFees
'nonce'
increment
->_tokenApprovals
int8
127
'newImplementation'
wrong
'TMP_96'
factoryAddress
TMP_470
dont
userLocked
->userLocked
poolNo
'REF_18'
TMP_699
TMP_700
TMP_701
_pendingOwner
_numTokensSellToAddToLiquidity
whitelist
_REWARD_RESERVE_
VAULT_NOT_ENOUGH
'_REWARD_RESERVE_'
_REWARD_TOKEN_
'TMP_102'
'this'
!safe
blacklisted
->blacklisted
reflectionFee
_reflectionFee
_marketingFee
ecosystemfee
_ecosystemfee
burnFee
_burnFee
'_reflectionFee'
'_marketingFee'
'TMP_301'
'_ecosystemfee'
'TMP_302'
'_burnFee'
totalFee
feeDenominator
_feeDenominator
Fees
more
50%
'TMP_304'
'TMP_306'
pancakePair
'TMP_307'
'TMP_309'
tSupply
ofAddress
getBNBReward
'REF_53'
'REF_56'
ADD_ERROR
_creator
_tradeBurnRatio
5000
TRADE_BURN_RATIO_INVALID
_tradeFeeRatio
TRADE_FEE_RATIO_INVALID
tradeBurnRatio
tradeFeeRatio
team
_team
TMP_1988
IncludeInFee
ETH_TRANSFER_FAILED
TMP_446
TMP_447
BridgeManager/not-authorized
CANNOT_WITHDRAW_ZERO
_updateAllReward
REF_326
REF_327
TMP_443
'REF_327'
TMP_444
_TOKEN_
'TMP_444'
preventReentrant
'TMP_92'
TMP_951
_isValidMatingPair
'REF_99'
'REF_103'
hireAddress
_newAddress
IHire
hireInter
farmDeps
->farmDeps
FarmDep
onlyWhitelistSetter
TMP_523
TMP_524
AggregatorV3Interface
latestTimestamp
_ORACLE_EXPIRATION_TIME
CC
stale
inverseAndSpread
_INVERSE_MASK
inverse
~
spread
latestAnswer
_SPREAD_DENOMINATOR
TMP_251
'pausers'
_eth
IWETHelper
WETHelper
safeTransferETH
isAdd
_allowMintTotalAmout
updateAllowAmount
_allowMintAmout
onlyApprove
StorageSlot
AddressSlot
m_encodeAddress_asm_0
20
29230032746618058364073696654325660393118650859520
52
encodeBytes
REF_202
REF_203
'REF_202'
'REF_203'
'amountIn'
_swapSupportingFeeOnTransferTokens
'TMP_341'
amountOutMin
INSUFFICIENT_OUTPUT_AMOUNT
IWETH
_removePauser
iteration_
bytes4Array_
->bytes4Array_
LandTokenStakingV2
pendingReward
rewardAmt
deposit
_beneficiary
'TMP_36'
TMP_468
->_isBlacklisted
'REF_82'
'TMP_136'
'TMP_137'
delegateToViewImplementation
Operator
_transferOperator
newOperator_
FULLBNB
TUser
USERS
referrer
_referrer
TDeposit
->USERS
upline
REFERRAL_PERCENTS
refCount
RefInvited
switch_expr_965_164_0__delegate_asm_0
TRANSFER
callData
returnData
returnDataResult
egg
DrivenX
_egg
eggPerBlock
_eggPerBlock
_startBlock
getAddressSlot
'_BEACON_SLOT'
UpgradeabilityProxy
currentImplementation
_newImplementation
_version
_newVersion
_proxy
unirouter
_unirouter
receiver
IPayable
pay
'serviceName'
taxFeeBps_
tax
liquidityFeeBps_
charityFeeBps_
charity
charityAddress_
Cant
both
and
percent
Total
over
25%
totalSupply_
_charityAddress
_charityFee
_previousCharityFee
'totalSupply_'
'5'
'TMP_99'
router_
_uniswapV2Router
IUniswapV2Factory
createPair
'TMP_106'
'TMP_107'
uniswapV2Pair
TokenType
liquidityGenerator
TokenCreated
VERSION
serviceFeeReceiver_
serviceFee_
_isSiringPermitted
trackCheckpointCounts
trackId
nCheckpoints
IFAllocationMaster
TrackCheckpoint
trackCheckpoints
uint80
lower
upper
center
tempCp
_sheera_old
'sender'
SheeraSwapper
hold
valid
Shera
getNewTokenAmount
_sheera_new
'TMP_132'
'TMP_133'
TMP_802
TMP_803
TUPLE_88
'TMP_803'
TMP_804
'_feeTransfer'
'PERCENTS_DIVIDER'
feeTransfer
'feeTransfer'
amountAfterFee
whiteListSender
whiteListReceiver
_feeWallet
'TMP_68'
_lgePairAddress
WhiteListed
getLGEWhitelistRound
wlRoundNumber
LGE
Buyer
whitelisted
amountRemaining
->wlRound
trustedToken
'_partnerWallet'
partner
ptr_clone_asm_0
27761015121370945702841756132291408947225067396391833351439392058184680079360
<<
41139691581125832123751684423152938008022000117167846770730729286376345305088
create
55
instance
ERC1167
TMP_807
'_PHASE_CALM_ENDTIME_'
'_SETTLEMENT_EXPIRE_'
TMP_808
TMP_809
NOT_EMERGENCY
CPFunding
_settle
_QUOTE_TOKEN_
'TMP_811'
_UNUSED_QUOTE_
CPStorage
isNotForceStop
phaseSettlement
decreaseAllowance
REF_111
_a
_b
_direct
_renounce
ERC20Pausable
CP
'rFee'
liquiditySellFee
buybackSellFee
marketingSellFee
burnSellFee
marketingFeeReceiver
1214355565666281541987209009293026401477399870968
TMP_566
'liquiditySellFee'
'buybackSellFee'
TMP_567
'TMP_566'
'marketingSellFee'
TMP_568
'TMP_567'
'burnSellFee'
sellTaxRate
TMP_569
48097906828771290246169966966667531108504481554
buyBackToken
minAmountToLiquify
_feeWhiteList
ApprovedEngine
130000000
totalTokens
TORENT
TNX
_claim
to_payout
dripToken
IToken
'dripVaultAddress'
vaultBalance
Vault
run
'ExitTax'
'to_payout'
'TMP_255'
'TMP_256'
realizedPayout
'BurnTax'
'TMP_258'
burnAmount
dripVault
IDripVault
'TMP_260'
'realizedPayout'
'57005'
'burnAmount'
REF_145
Leaderboard
_liquidityAddress
TMP_1902
positive
DBTC
blacklist
->blacklist
repayBorrowBehalf
repayAmount
'REF_105'
Allowance'
'REF_161'
REF_163
'REF_164'
type
IERC165
33540519
interfaceId
bsubSign
base
xneg
term
sum
negative
precision
bigK
cneg
bdiv
badd
'REF_19'
rewardFrequencySeconds
BytesLib
TrackInfo
tracks
track
prev
trackDisabled
isDisabled
addElseSub
#
REF_201
additionalBlocks
uint192
uint24
weightAccrualRate
uint104
marginalAccruedStakeWeight
REF_204
totalStakeWeight
newStakeWeight
_bumpSaleCounter
trackTotalActiveRollOvers
REF_206
numFinishedSales
activeRolloverWeight
activeRolloverRate
ROLLOVER_FACTOR_DECIMALS
passiveRolloverRate
BumpSaleCounter
AddTrackCheckpoint
->trackCheckpoints
->prev
REF_232
REF_233
REF_234
_tokenContractAddress
IERC223Token
'TMP_3'
forwarderBalance
'parentAddress'
'forwarderBalance'
TokensFlushed
ForwarderContract
onlyParent
devrewardPercentage
devrewardWallet
TUPLE_13
'REF_147'
'REF_150'
'REF_153'
Owned
ETH
684995033931875175734746584787067313875802999601
setUpgradeabilityOwner
m
_SHARES_
->_SHARES_
'_TOTAL_SHARES_'
_TOTAL_SHARES_
TMP_695
TMP_697
entry
CyBallMarket
auctions
_nftAddress
startedAt
payToken
INTEGER_UNDERFLOW
autoLiquidityReceiver
_autoLiquidityReceiver
_marketingFeeReceiver
devFeeReceiver
_devFeeReceiver
burnFeeReceiver
_burnFeeReceiver
teamFeeReceiver
_teamFeeReceiver
TMP_1402
_notEntered
re-entered
tierListTimeLimit
_level
->tierListTimeLimit
_timeLimit
TierListTimeLimitUpdated
'REF_21'
currentLotteryId
PancakeSwapLottery
Lottery
_lotteries
Status
start
lottery
_endTime
MIN_LENGTH_LOTTERY
MAX_LENGTH_LOTTERY
outside
range
_priceTicketInCake
minPriceTicketInCake
maxPriceTicketInCake
Outside
limits
_discountDivisor
MIN_DISCOUNT_DIVISOR
Discount
too
low
_treasuryFee
MAX_TREASURY_FEE
Treasury
high
_rewardsBreakdown
REF_165
Rewards
equal
Open
<slither
slithir
variables
temporary
TemporaryVariable
object
at
0x7f588426a208>
0x7f588426a198>
0x7f588426a5c0>
0x7f588426a438>
0x7f588426a668>
0x7f588426a710>
0x7f588426a7b8>
0x7f588426a860>
0x7f588426a908>
0x7f588426a9b0>
0x7f588426aa58>
0x7f588426ab00>
currentTicketId
pendingInjectionNextLottery
->_lotteries
LotteryOpen
onlyOperator
My
DeFi
MDP
supportsInterface
InterfaceSignature_KRC165
tokensOfOwner
tokenMetadata
InterfaceSignature_KRC721
'TMP_19'
TRX_TRANSFER_FAILED
_isApprovedOrOwner
nor
TMP_2270
_dexRouter
dexRouter
256
'TMP_353'
'TMP_355'
minterAccount_
Minter
null
minterAccount
RewardToken
output
TMP_561
'TMP_560'
toNative
TMP_562
IUniswapRouterETH
TMP_563
TMP_564
swapExactTokensForTokens
'toNative'
'toNativeRoute'
'TMP_563'
'now'
TMP_684
TMP_685
TMP_687
_bidAmount
TMP_688
_removeAuction
TMP_690
TMP_691
_computeCut
auctioneerCut
sellerProceeds
dpetToken
IKRC20
'seller'
'sellerProceeds'
TMP_696
bidExcess
TMP_698
'bidExcess'
AuctionSuccessful
'_currentSnapshotId'
currentId
Snapshot
1334300240417897829519312371703928001456515237901
311462732628473508340740800655040070727878546112
272585159650046547257172794025979844625750731291
Denied
TMP_434
TMP_435
TMP_436
TO_ADDRESS_IS_EMPTY
BALANCE_NOT_ENOUGH
OwnershipRenounced
DividendsDistributed
'totalDividendsDistributed'
totalDividendsDistributed
subUInt
'TMP_124'
1435157332837666145860554639704111507284905430280
isSaleClockAuction
FPT
unstaking
MasterChefFrontPoint
good
accFPTPerShare
'REF_217'
'REF_219'
'TMP_399'
'TMP_400'
'REF_222'
safeFPTTransfer
'REF_224'
'REF_226'
'TMP_406'
'REF_229'
'totalLpToken'
totalLpToken
'REF_233'
'REF_235'
onlyMineable
'REF_12'
'swapThreshold'
'dynamicLiquidityFee'
'TMP_253'
'totalFee'
'TMP_254'
amountToLiquify
'amountToLiquify'
amountToSwap
'amountToSwap'
amountBNB
totalBNBFee
'amountBNB'
'TMP_269'
'totalBNBFee'
'TMP_270'
amountBNBLiquidity
'reflectionFee'
'TMP_272'
amountBNBReflection
'marketingFee'
amountBNBMarketing
'ecosystemfee'
'TMP_276'
amountBNBDev
distributor
30000
tmpSuccess
ecosystemfeeReceiver
'TMP_282'
'autoLiquidityReceiver'
AutoLiquify
swapping
isOverLiquified
dynamicLiquidityFee
currentIndex
_swapAndLiquifyEnabled
_fee
BridgeManager/The
ZERO_ADDRESS
Unlocked
pos
amountToRecover
Operations
recover
'amountToRecover'
TokenRecovery
TMP_820
TMP_821
operators
_pool
Matches
Present
totalRewards
startTime
start/end
results
Results
matchId
matches
Match
espnMatchId
present
->pools
PoolAdded
NUM_PERMISSIONS
ChangeFees
->permissionNameToIndex
Buyback
AdjustContractVariables
Authorize
PauseUnpauseContract
BypassPause
LockPermissions
ExcludeInclude
Blacklist
permissionIndexToName
->permissionIndexToName
gasLimitActive
antiGas
TMP_2278
_safeMint
STPayable
_nftToken
erc20Token
_erc20Token
tokensPerBlock
_tokensPerBlock
StakeRewardUpdated
approval
all
TMP_1916
INVALID
INPUT
numCheckpoints
checkpoints
votes
'accuracy'
'TMP_321'
getCirculatingSupply
'TMP_323'
fromTimestamp
toTimestamp
_seconds
'REF_75'
REWARD_ID_NOT_FOUND
rt
endBlock
MINING_NOT_FINISHED
lastFlagBlock
'REF_277'
'REF_279'
gap
workThroughReward
rewardPerBlock
'gap'
'REF_283'
'REF_280'
'TMP_377'
totalReward
IRewardVault
_TOTAL_REWARD_
totalDepositReward
'totalDepositReward'
'totalReward'
NOT_ENOUGH
withdrawLeftOver
WithdrawLeftOver
finalized
Bonding
hasn't
been
T2K
t2k_owed
T2k
->t2k_owed
TMP_764
REF_539
TMP_765
TMP_766
TMP_767
REF_540
SET_INTEREST_RATE_MODEL_ACCRUE_INTEREST_FAILED
TMP_768
TMP_769
_setInterestRateModelFresh
redeemTokensIn
redeemAmountIn
one
REDEEM_EXCHANGE_RATE_READ_FAILED
TMP_432
TMP_433
redeemTokens
redeemAmount
TUPLE_68
REDEEM_EXCHANGE_TOKENS_CALCULATION_FAILED
TUPLE_69
REDEEM_EXCHANGE_AMOUNT_CALCULATION_FAILED
REF_305
redeemAllowed
'TMP_442'
'redeemer'
'REF_305'
REDEEM_COMPTROLLER_REJECTION
TMP_445
REDEEM_FRESHNESS_CHECK
TMP_448
TUPLE_70
REF_313
REF_314
REF_315
REDEEM_NEW_TOTAL_SUPPLY_CALCULATION_FAILED
redeemer
REF_321
TUPLE_71
REF_322
REF_323
TMP_452
REF_324
REF_325
REDEEM_NEW_ACCOUNT_BALANCE_CALCULATION_FAILED
TMP_454
TMP_455
TMP_456
REF_328
REF_329
REDEEM_TRANSFER_OUT_NOT_POSSIBLE
REF_330
REF_331
REF_332
REF_333
TMP_459
REF_334
REF_335
REF_336
Redeem
TMP_462
REF_338
REF_339
redeemVerify
'TMP_462'
'REF_338'
'REF_339'
REF_340
TMP_464
_accountBalanceSnapshots
_updateSnapshot
TMP_1808
ERC1967
'_ADMIN_SLOT'
->TMP_69
65
byte
vs_recover_asm_1
TMP_659
TMP_1640
bytes9
symbolBytes
TMP_588
TMP_589
symbolLength
j
TMP_591
TMP_592
MINIMUM_BEP20_SYMBOL_LEN
TMP_595
TMP_596
TMP_597
45
TMP_598
TMP_599
M
'REF_193'
currentKey
freezings
'REF_196'
->freezings
freezingBalance
'REF_199'
->freezingBalance
freeze
Freezed
treasuryPool
_treasuryPool
CODE_OK
ERROR_FAIL_DECODE
BIND_CHANNELID
TRANSFER_IN_CHANNELID
TRANSFER_OUT_CHANNELID
STAKING_CHANNELID
GOV_CHANNELID
SLASH_CHANNELID
bscChainID
56
4096
SLASH_CONTRACT_ADDR
4097
SYSTEM_REWARD_ADDR
4098
LIGHT_CLIENT_ADDR
4099
TOKEN_HUB_ADDR
4100
INCENTIVIZE_ADDR
4101
RELAYERHUB_CONTRACT_ADDR
4102
4103
TOKEN_MANAGER_ADDR
4104
CROSS_CHAIN_CONTRACT_ADDR
8192
'TMP_60'
SUB_ERROR
TUPLE_29
TUPLE_30
initialAmount
AnyPad
APAD
!EOA
isAntiWhale
_isAntiWhale
TMP_736
REF_555
TMP_737
TMP_738
TMP_739
REF_556
ADD_RESERVES_ACCRUE_INTEREST_FAILED
TMP_740
TUPLE_86
