[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
bytes32
codehash
accountHash
=
0xc5d2460186f7233c927e7db2dcc703c0e500b653ca82273b7bfad8045d85a470
assembly
:
extcodehash
account
return
!
0x0
&
callOptionalReturn
token
abi
encodeWithSelector
transfer
selector
to
value
transferFrom
from
require
0
||
allowance
address
this
spender
SafeERC20
approve
non
-
zero
isContract
call
contract
bool
success
bytes
memory
returndata
data
low
level
failed
decode
ERC20
operation
did
not
succeed
mpc
if
block
timestamp
>
delayVault
pendingVault
vault
_vaultOnly
enabled
_init
_vault
isMinter
true
minters
push
false
pendingMinter
_auth
delayMinter
+
delay
newVault
AnyswapV3ERC20
emit
LogChangeVault
LogChangeMPCOwner
_mint
amount
_burn
LogSwapin
txhash
AnyswapV4ERC20
onlyAuth
bindaddr
msg
sender
LogSwapout
_totalSupply
IERC20
underlying
permit
target
deadline
v
r
s
safeTransferFrom
_deposit
transferWithPermit
uint
_amount
balanceOf
_withdraw
safeTransfer
mint
the
Transfer
burn
Approval
IApprovalReceiver
onTokenApproval
<
Expired
hashStruct
keccak256
encode
PERMIT_TYPEHASH
nonces
verifyEIP712
verifyPersonalSign
TRANSFER_TYPEHASH
uint256
balance
exceeds
hash
encodePacked
\x19\x01
DOMAIN_SEPARATOR
signer
ecrecover
prefixed
\x19Ethereum
Signed
Message
\n32
allowed
type
max
request
reduced
ITransferReceiver
onTokenTransfer
c
a
b
SafeMath
addition
overflow
sub
subtraction
errorMessage
multiplication
div
division
by
authorizations
owner
OwnershipTransferred
minPeriod
_minPeriod
minDistribution
_minDistribution
shares
shareholder
distributeDividend
addShareholder
else
removeShareholder
totalShares
add
totalExcluded
getCumulativeDividends
balanceBefore
BUSD
path
new
2
WBNB
1
router
swapExactETHForTokensSupportingFeeOnTransferTokens
totalDividends
dividendsPerShare
dividendsPerShareAccuracyFactor
mul
shareholderCount
shareholders
length
gasUsed
gasLeft
gasleft
iterations
while
gas
currentIndex
shouldDistribute
shareholderClaims
getUnpaidEarnings
totalDistributed
totalRealised
shareholderTotalDividends
shareholderTotalExcluded
share
shareholderIndexes
pop
calldatacopy
calldatasize
let
result
delegatecall
implementation
returndatacopy
returndatasize
switch
case
revert
default
_willFallback
_delegate
_implementation
size
extcodesize
Address
insufficient
recipient
unable
send
may
have
reverted
for
_verifyCallResult
static
staticcall
returndata_size
mload
32
slot
IMPLEMENTATION_SLOT
impl
sload
_setImplementation
newImplementation
Upgraded
Cannot
set
proxy
sstore
mod
modulo
%
_newOwner
sending
has
role
Roles
already
bearer
does
is
tokens
Tokens
cannot
be
transferred
user
locking
BURNT
timeNow
transData
1440
minutes
FOR
VALUE
PROTECTION
YOU
CAN
ONLY
CLAIM
ONCE
EVERY
24
HOURS
transferToAmount
totalBurnt
Error
in
un
staking
saveTransData
_timestamp
delegate
unchecked
_owner
newOwner
Ownable
_name
_symbol
_decimals
_tTotal
moveBnbToWallets
state
_isExcluded
_tOwned
tokenFromReflection
_rOwned
_transfer
_msgSender
_allowances
_approve
addedValue
subtractedValue
decreased
below
_tFeeTotal
tAmount
Amount
must
less
than
supply
deductTransferFee
rAmount
_getValues
rTransferAmount
_rTotal
total
reflections
currentRate
_getRate
Account
excluded
_excluded
included
i
break
excludedFromFees
addLiq
liq
swapBnbActive
swap
buyFee
buyReflectionFee
buyLiqFee
buyMarketingFee
buyRndFee
sellFee
sellReflectionFee
sellLiqFee
sellMarketingFee
sellRndFee
buyReflection
buyLiq
buyMarketing
buyRnd
setFees
sellReflection
sellLiq
sellMarketing
sellRnd
rFee
tFee
tTransferAmount
tLiquidity
tMarketing
tRnd
_getTValues
_getRValues
calculateReflectionFee
calculateLiquidityFee
calculateMarketingFee
calculateRndFee
rLiquidity
rMarketing
rRnd
rSupply
tSupply
_getCurrentSupply
_ReflectionFee
_LiqFee
_MarketingFee
_RndFee
_MnmReflectionFee
_MnmMarketingFee
_MnmRndFee
_MnmLiqFee
tradeType
success1
payable
_MarketingWalletAddress
marketing_part
30000
success2
_RndWalletAddress
Rnd_part
initialBalance
swaptokensamount
contractTokenBalance
liq_part
swapTokensForEth
newBalance
addLiquidity
liq_part_percent
remaningBnb
sendToWallet
_value
_token
_sent
_to
swapAndLiquifyEnabled
_state
minimumTokensBeforeSwap
_minimumTokensBeforeSwap
_target
_status
uniswapV2Router
WETH
tokenAmount
swapExactTokensForETHSupportingFeeOnTransferTokens
trade_type
takeFee
overMinimumTokenBalance
marketActive
premarketUser
trade
before
market
opening
isInternalTransaction
automatedMarketMakerPairs
blockMultiBuys
MarketActiveAt
3
You
buy
at
launch
userLastTradeData
lastBuyTime
buySecondsLimit
do
multi
orders
uniswapV2Pair
swapAndLiquify
_tokenTransfer
addLiquidityETH
ethAmount
_transferFromExcluded
_transferToExcluded
_transferStandard
_transferBothExcluded
_takeLiquidity
_takeRnd
_takeMarketing
_reflectFee
weiValue
greater
100
reflectFees
_beforeFallback
StorageSlot
getAddressSlot
_IMPLEMENTATION_SLOT
ERC1967
_ADMIN_SLOT
newAdmin
admin
AdminChanged
_getAdmin
_setAdmin
_BEACON_SLOT
newBeacon
beacon
IBeacon
ERC1967Upgrade
_getImplementation
admin_
implementation_
_changeAdmin
_upgradeToAndCall
TransparentUpgradeableProxy
fallback
super
uint128
uint64
0x0100000000000000000000000000000000
number
0x010000000000000000
0x0100000000
uint32
0x010000
uint16
?
invalid
_balances
_spender
_from
_addVal
_subVal
newAllowance
mobox_
finance_
param
poolName
name_
finance
moboxToken
devTeam
addr_
addr
to_
reason_
256
devTeamAmount
amount_
devTeamRate
10000
eventAmount
IMoboxToken
mbox
EventApply
EventPoolBurn
UpgradeableProxy
_admin
_upgradeTo
adm
_maxSupply
_totalTokens
you
can't
more
maxSupply
setSwapEnabled
setFeeEnabled
setAutoLiquidityWallet
activateBuying
onActivated
doTransfer
doApprove
isPancakeSwapPair
_isBuyingAllowed
Buying
activation
isTransferLimited
_transactionLimit
maximum
executeSwapIfNeeded
onBeforeTransfer
feeRate
calculateFeeRate
transferAmount
feeAmount
updateBalances
_totalFeesPooled
onTransfer
receivedAmount
sentAmount
applyFees
_isFeeEnabled
_addressesExcludedFromFees
_poolFee
_additionalSellFee
isMarketTransfer
tokensAvailableForSwap
_tokenSwapThreshold
isSelling
executeSwap
_pancakeSwapRouterAddress
tokensReservedForReward
tokensReservedForLiquidity
tokensToSwapForLiquidity
tokensToAddAsLiquidity
tokensToSwap
bnbSwapped
swapTokensForBNB
bnbAddedToLiquidity
_pancakeswapV2Router
bnbToBeAddedToLiquidity
_autoLiquidityWallet
360
_totalBNBLiquidityAddedFromFees
Swapped
try
bnbAmount
_addressesSignedForLargeAmount
isContractSelling
isSwapTransfer
routerAddress
use
as
IPancakeRouter02
_pancakeswapV2Pair
IPancakeFactory
factory
createPair
onPancakeSwapRouterUpdated
liquidityFee
8
Liquidity
fee
between
and
rewardFee
15
Reward
additionalSellFee
5
Additional
sell
exceed
25
Total
fees
_liquidityFee
_rewardFee
limit
Limit
01
threshold
Threshold
NAME
SYMBOL
DECIMALS
liquidityWallet
_isSwapEnabled
isEnabled
setRewardAsTokensEnabled
setAutoClaimEnabled
setReimburseAfterLioEClaimFailure
_lastBurnDate
_nextAvailableClaimDate
calculateRewardCycleExtension
burnTriggered
processGradualBurn
isAutoClaimEnabled
processRewardClaimQueue
_maxGasForAutoClaim
catch
updateAutoClaimQueue
shouldBurn
doBuyAndBurn
burnAmount
isQueued
_addressesInRewardClaimQueue
isIncludedInRewards
index
_rewardClaimQueueIndices
lastUser
_rewardClaimQueue
delete
claimReward
isClaimApproved
are
claim
rewards
on
behalf
of
isRewardReady
Claim
date
passed
yet
make
sure
there
enough
LioE
doClaimReward
rewardCyclePeriod
claimBnb
claimBnbAsTokens
calculateClaimRewards
tokenClaimSuccess
claimLioE
_reimburseAfterLioEClaimFailure
bnbClaimSuccess
claimBNB
RewardClaimed
_sendWeiGasLimit
sent
_bnbRewardClaimed
_totalBNBClaimed
swapBNBForTokens
_bnbAsLioEClaimed
_totalBNBAsLioEClaimed
Gas
required
queueLength
iteration
_processingQueue
_rewardClaimQueueIndex
newGasLeft
consumedGas
_whitelistedExternalProcessors
Not
whitelisted
instead
startGas
_excludeNonHumansFromRewards
_minRewardBalance
_addressesExcludedFromRewards
basePeriod
rate
_rewardCycleExtensionThreshold
extension
reward
calculateBNBReward
ofAddress
_rewardAsTokensEnabled
percentage
_claimRewardAsTokensPercentage
holdersAmount
totalAmountOfTokensHeld
bnbPool
_mainBnbPoolSize
_maxClaimAllowed
pancakeSwapRouterAddress
pancakeSwapPairAddress
isBurnTransfer
BURN_WALLET
_gradualBurnMagnitude
_minBnbPoolSizeBeforeBurn
_gradualBurnTimespan
Manual
too
high
Burned
totalSupply
byAddress
_rewardCyclePeriod
period
7
days
Value
out
range
_autoClaimEnabled
isExcluded
_globalRewardDampeningPercentage
90
Invalid
_rewardClaimApprovals
isApproved
magnitude
Must
equal
or
timespan
10
ether
Size
small
isWhitelisted
exclude
WhitelisterTransferred
_whitelister
_transferWhitelister
newWhitelister
New
whitelister
durations
amountsMax
whitelist
_lgePairAddress
pairAddress
_lgeWhitelistRounds
WhitelistRound
amountMax
duration
addresses
_lgeTimestamp
wlCloseTimestampLast
storage
wlRound
now
purchased
wlRoundNumber
getLGEWhitelistRound
LGE
Buyer
amountRemaining
_beforeTokenTransfer
decimals_
LGEWhitelisted
_applyLGEWhitelist
_transferOwnership
_fallback
OpenZeppelinUpgradesAddress
change
ADMIN_SLOT
18
currentAllowance
_afterTokenTransfer
accountBalance
_setOwner
oldOwner
_callOptionalReturn
temp
digits
buffer
bytes1
uint8
48
string
0x00
toHexString
x
alphabet
0xf
4
interfaceId
IERC165
IERC721
IERC721Metadata
supportsInterface
ERC721
query
_owners
tokenId
nonexistent
_exists
ERC721Metadata
URI
baseURI
_baseURI
toString
''
ownerOf
approval
current
isApprovedForAll
caller
nor
approved
all
_tokenApprovals
operator
_operatorApprovals
ApprovalForAll
_isApprovedOrOwner
_safeTransfer
_data
_checkOnERC721Received
ERC721Receiver
implementer
getApproved
_safeMint
minted
that
own
IERC721Enumerable
ERC721Enumerable
bounds
_ownedTokens
_allTokens
global
_addTokenToAllTokensEnumeration
_removeTokenFromOwnerEnumeration
_removeTokenFromAllTokensEnumeration
_addTokenToOwnerEnumeration
_ownedTokensIndex
_allTokensIndex
lastTokenIndex
tokenIndex
lastTokenId
ERC721Burnable
IAccessControl
_roles
members
hasRole
AccessControl
Strings
uint160
20
missing
adminRole
_grantRole
_revokeRole
can
only
renounce
roles
self
RoleAdminChanged
getRoleAdmin
RoleGranted
RoleRevoked
_hasNFT
_NFTContractSet
_NFTContract
_taxFee
_isExcludedFromFee
NFTContract
been
_starter
Starter
starter
Only
startTime
_startTime
StartTime
error
_maxTxAmount
maxTxPercent
_enabled
SwapAndLiquifyEnabledUpdated
hasNFT
calculateTaxFee
_previousTaxFee
_previousLiquidityFee
half
otherHalf
SwapAndLiquify
removeAllFee
restoreAllFee
9
int256
map
values
key
inserted
int
indexOf
keys
val
lastIndex
lastKey
magnifiedDividendPerShare
DividendsDistributed
totalDividendsDistributed
_withdrawDividendOfUser
_withdrawableDividend
withdrawableDividendOf
withdrawnDividends
DividendWithdrawn
3000
accumulativeDividendOf
toInt256Safe
magnifiedDividendCorrections
toUint256Safe
_magCorrection
currentBalance
mintAmount
newAddress
pancakeRouter
AstroSpaces
The
UpdatePancakeRouter
_pancakePair
pancakePair
dividendTracker
excludeFromDividends
excludeFromAllLimits
_isExcludedFromFees
status
SetSwapTokensAtAmount
swapTokensAtAmount
product
_ProductFee
marketingFee
dividendFee
_DividendFee
totalFees
26
Too
much
SetBuyFees
sellProductFee
_SellProductFee
_SellMarketingFee
sellDividendFee
_SellDividendFee
SetSellFees
newProductWallet
'Product
Zero
address'
newMarketingWallet
'Marketing
UpdateWallets
marketingWallet
productWallet
canTransferBeforeTradingIsEnabled
excludedFromDividends
dividend
tracker
AstroSpacesDividendTracker
newDividendTracker
owned
UpdateDividendTracker
'excluded'
ExcludeFromFees
accounts
ExcludeMultipleAccountsFromFees
newValue
200000
500000
gasForProcessing
200
000
500
update
same
GasForProcessingUpdated
updateClaimWait
claimWait
updateMinimumTokenBalanceForDividends
newTokenBalance
claims
lastProcessedIndex
process
ProcessedDividendTracker
tx
origin
processAccount
getLastProcessedIndex
getNumberOfTokenHolders
swappingEnabled
UpdateSwappingStatus
tradingEnabled
UpdateTradingStatus
StartSwapTokensForEth
FinishSwapTokensForEth
accTotal
accProductFee
accDividendFee
accMarketingFee
forMarketing
forProduct
forDividends
CalculatedBNBForEachRecipient
SwapAndSendTo
MARKETING
ANTI
DUMP
DIVIDENDS
senderBalance
_lockTime
_previousOwner
time
don't
permission
unlock
Contract
locked
until
buyBackUpperLimit
transferredBalance
transferToAddressETH
marketingAddress
marketingDivisor
swapETHForTokens
SwapTokensForETH
300
SwapETHForTokens
taxFee
maxTxAmount
divisor
_marketingAddress
buyBackEnabled
BuyBackEnabledUpdated
setSwapAndLiquifyEnabled
_paused
Paused
Unpaused
blacklisted
BEP20
Blacklisted
UnBlacklisted
_HEX_SYMBOLS
previousAdminRole
_contains
_values
_indexes
valueIndex
toDeleteIndex
lastvalue
_add
_inner
_remove
_length
_at
store
IAccessControlEnumerable
_roleMembers
grantRole
revokeRole
remove
renounceRole
_setupRole
counter
Counter
decrement
_baseTokenURI
cap
DragonKartNFTCore
exceeded
tokenId_
_cap
cap_
CapUpdated
newCap
_updateCap
baseTokenURI_
_tokenId
_tokenIdTracker
increment
_pause
_unpause
itemFactory
IItemFactory
itemFactory_
ItemFactoryUpdated
randomGenerator
IRandomGenerator
randomGenerator_
UpdateRandomGenerator
randomFee
randomFee_
UpdateRandomFee
RandomConsumerBase
CallerNotOwner
NotZeroAddress
CallerNotApproved
previousOwner
ownerRoles
Role
BuyBack
enable
NftBridge
Limits
Fees
Exchanges
CrossChainBuyback
Upgrader
uint96
Overflow
code
pair
tokenLookup
token0Selector
token1Selector
_isWalletLocked
fromAddress
WalletLocked
_approvals
unlockTimestamp
tokenCheck
DOMAIN_TYPEHASH
name
chainid
nonce
Allowance
_allowance
allowances
ApprovalChecks
_approval
autoRevokeNftHours
uint48
nftCheck
nftApproval
allowanceSettings
tokenApproval
altAccount
_userUnlocks
LockWallet
currentLock
Unlocked
newLock
LockTimeTooShort
LockWalletExtend
actualAccount
nfts
RevokeAllApprovals
nftsHrs
autoRevokeTokenHours
tokensHrs
SetApprovalAutoTimeout
_swapEnabled
_TRUE
_offchainBalanceExcluded
_buyBackEnabled
_liquidityLocked
_autoBurn
_burnableTokens
BurnableTokensZeroed
burnAddress
_burnAddress
BurnAddressUpdated
_FALSE
OffChainBalanceExcluded
LiquidityLocked
AutoBurnEnabled
InvalidAddress
ExcludeFromFeeUpdated
_exchangeHotWallet
ExchangeHotWalletAdded
ExchangeHotWalletRemoved
IncludeInFeeUpdated
txAmount
100_000
AmountOutOfRange
transactionCap
TransactionCapUpdated
1_000_000
_numberOfBlocks
BuybackBlocksUpdated
businessDevelopmentDivisor
BusinessDevelopmentDivisorUpdated
stakeToken
InftEverRise
contractAddress
excludeFromFee
StakingAddressUpdated
IUniswapV2Router02
_uniswapV2Router
IUniswapV2Factory
getPair
RouterAddressUpdated
SwapEnabledUpdated
liquidityFeeRate
LiquidityFeeUpdated
EverRise
_holders
_amountLocked
_balanceOf
everBridgeVault
_inSwap
_lastTransfer
blockNumber
_validateIfLiquidityChange
uint112
startHolderCount
holderCount
fromAfter
toBefore
_buyback
BuyBackCrossChainTriggered
swapTokens
IUniswapV2Pair
sync
AutoBurn
_buyBackMinAvailability
_latestBuybackBlock
buybackAmount
_nextBuybackAmount
_maxBuybackAmount
boughtBack
_buyBackTokens
tokensBefore
EverRiseLib
swapETHForTokensNoFee
tokensReceived
BuybackTokensWithETH
_distributeStakingRewards
initialETHBalance
transferredETHBalance
ConvertTokensForETH
sendEthViaCall
businessDevelopmentAddress
createRewards
RewardStakers
NotStakeContractRequesting
_lockedTokenTransfer
toAddress
amountToTransfer
staker
stakeCreateCost
NotEnoughToCoverStakeFee
nftId
enterStaking
numOfMonths
_lockAndAddStaker
lockedAmount
AmountLargerThanUnlockedAmount
emitEvent
StakingDecreased
leaveStaking
overrideNotClaimed
_decreaseLockedAmount
removeStaker
newNftId
penaltyAmount
earlyWithdraw
reissueStakeNft
withdraw
_setApprovalForAll
_isApprovedForAll
bridgeAddress
NotContractAddress
_walletLock
bridgeStakeNftOut
NftBridgedOut
_increaseLockedAmount
addStaker
StakingIncreased
balance0
token0
token1
pairTokens
balance1
TransferDetails
switchTokens
LiquidityAddOwnerOnly
hasTokenStarted
TokenAlreadyStarted
TokenStarted
FailedEthSend
tokenAddress
transferTokens
TransferExternalTokens
holder
_limitSupply
availableSupply
Supply
ApproveAndCallFallBack
receiveApproval
extraData
_contracts
approveAndCall
ERC20Capped
MINTER_ROLE
ERC20PresetMinterPauser
minter
PAUSER_ROLE
pauser
pause
unpause
buyBackSellLimit
_newPancakeRouter
newRouter
newPair
newLiquidityWallet
convertedBalance
charityAddress
charityDivisor
developmentAddress
developmentDivisor
swapETHForTokensAndBurn
tVault
_takeVault
calculateVaultFee
rVault
vaultRewardAddress
_tempTaxFee
_tempVaultFee
_tempLiquidityFee
bots_
bots
cooldown
notbot
_address
amounts
getAmountsOut
_buyBackDivisor
newDivisor
newPercent
larger
_buyBackRangeRate
_intervalMinutesForSwap
60
_vaultFee
vaultFee
_buyTaxFee
buyTaxFee
_buyVaultFee
buyVaultFee
_buyLiquidityFee
buyLiquidityFee
_sellTaxFee
sellTaxFee
_sellVaultFee
sellVaultFee
_sellLiquidityFee
sellLiquidityFee
buyBackSellSetLimit
_bMaxTxAmount
bMaxTxAmount
_sMaxTxAmount
sMaxTxAmount
_trigger
trigger
_developmentAddress
_charityAddress
_vaultAddress
_abmode
ABMode
_cooldownMode
CooldownMode
setABMode
setCooldownMode
setTradingOpen
tradingOpen
_router
_pair
Can't
take
native
_contractBalance
initialTokenBalance
SwapAndLiquifyBNB
SwapAndLiquifyTokens
_addressFees
_enable
_addressTaxFee
_addressVaultFee
_addressLiquidityFee
z
y
'ds
math
overflow'
underflow'
'Pancake
EXPIRED'
digest
'\x19\x01'
recoveredAddress
INVALID_SIGNATURE'
uint224
_reserve0
reserve0
_reserve1
reserve1
_blockTimestampLast
blockTimestampLast
SELECTOR
TRANSFER_FAILED'
_token0
_token1
OVERFLOW'
timeElapsed
blockTimestamp
Sync
feeTo
feeOn
_kLast
rootK
Math
sqrt
rootKLast
numerator
denominator
17
liquidity
kLast
amount0
amount1
_mintFee
MINIMUM_LIQUIDITY
min
INSUFFICIENT_LIQUIDITY_MINTED'
_update
Mint
INSUFFICIENT_LIQUIDITY_BURNED'
Burn
amount0Out
amount1Out
INSUFFICIENT_OUTPUT_AMOUNT'
INSUFFICIENT_LIQUIDITY'
INVALID_TO'
IPancakeCallee
pancakeCall
_burnFrom
_minters
_addMinter
_removeMinter
MinterAdded
MinterRemoved
wards
guy
TokenManager
deny
mappedTokens
ethTokenAddr
ethToken
mapping
exists
oneToken
tokenManager
removeToken
tokenAddr
Proxy
Attemps
with
ZOSLibAddress
round
roundTime
timeUnlockStart
sec
end
timeUnlockEnd
cailm
surplus
getBalance
_mining
getMyMined
sys
profit
miner
settle
2592000
miner_speed
getClaim
charityAmount
earned
miner_total
charity_rate2
msgValue
charity_rate1
miner_price
decreasedAllowance
assert
totalSupply_
balances
OwnershipRenounced
mintingFinished
MintFinished
freezingBalance
release
chains
toKey
_addr
count
_index
_release
_balance
freezings
currentKey
_until
freeze
Freezed
headKey
head
next
Released
getFreezing
releaseOnce
0x5749534800000000000000000000000000000000000000000000000000000000
0x10000000000000000
parentKey
nextKey
parent
_who
paused
Pause
Unpause
TOKEN_NAME
TOKEN_SYMBOL
TOKEN_DECIMALS_UINT8
initialized
PAUSED
CONTINUE_MINTING
finishMinting
Initialized
'Biswap
_swapFee
BiswapPair
lower
then
'BiswapPair
FORBIDDEN'
1000
FORBIDDEN_FEE'
swapFee
_devFee
devFee
IBiswapFactory
IBiswapCallee
BiswapCall
vaultOnly
LogRevokeAuth
symbol
decimals
_underlying
chainId
EIP712Domain
version
verifyingContract
newTotalSupply
tokenBlacklist
_addedValue
oldValue
_subtractedValue
_isBlackListed
Blacklist
increaseApproval
decreaseApproval
_blackList
listAddress
isBlackListed
_bs
0x20
0x7fffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff
bs
0x40
mstore
0x14
shl
96
sha256
byte
0x01
_l
_r
fslot
_preBytes_slot
slength
0x100
iszero
mlength
_postBytes
eq
lt
cb
sc
mc
m
_signers
j
_keepers
_m
67
lenggh
short
newkey
slice
35
66
0x02
0x03
Utils
collector
emtpy
feeCollector
_lockProxy
lockProxyIndexMap
no
lockproxy
exsist
given
ILockProxy
managerProxyContract
maxLockProxyIndex
toChainId
empty
_pull
fromAsset
_checkoutFee
lockProxy
_getSupportLockProxy
_push
PolyWrapperLock
id
isValidLockProxy
PolyWrapperSpeedUp
txHash
lockProxyAddress
lock
fail
safeApprove
erc20
assetHashMap
No
LockProxy
Support
cross
txn
res
assets
richGuy
'ERC20
allowance'
zero'
balance'
'0'
'ERC721
token'
'ERC721Metadata
owner'
all'
caller'
'ERC721Enumerable
bounds'
'Ownable
'Counter
560626895145777115775131129887469001763710975848
sign
_tBurnTotal
0x62a83739d919ea0C49EAB607aE8b92Eb846fd9C2
'router
'
tBurn
rBurn
_burnFee
burnFee
total_
percentage_
percentageToSub_
part_
sqrrt
multiplier_
payment_
supply_
_bytes
HEX
0123456789abcdef
42
account_
ammount_
_nonces
OwnershipPushed
newOwner_
pull
OwnershipPulled
d
strategy
want
IStrategy
1e18
deposit
beforeDeposit
_pool
earn
_after
_bal
available
_shares
_diff
Proposal
valid
Vault
stratCandidate
StratCandidate
proposedTime
NewStratCandidate
There
candidate
approvalDelay
Delay
UpgradeStrat
retireStrat
5000000000
0x095ea7b3
'TransferHelper
APPROVE_FAILED'
0xa9059cbb
0x23b872dd
TRANSFER_FROM_FAILED'
ETH_TRANSFER_FAILED'
tokenA
tokenB
'PancakeLibrary
IDENTICAL_ADDRESSES'
ZERO_ADDRESS'
sortTokens
hex'ff'
pairFor
IPancakePair
getReserves
reserveA
reserveB
amountA
INSUFFICIENT_AMOUNT'
amountB
amountIn
INSUFFICIENT_INPUT_AMOUNT'
reserveIn
reserveOut
amountInWithFee
9975
amountOut
INVALID_PATH'
getAmountOut
getAmountIn
input
output
PancakeLibrary
amountInput
amountOutput
reserveInput
reserveOutput
quote
'SafeMath
'Address
reverted'
'BEP20
_moveDelegates
_delegates
delegatee
srcRep
dstRep
srcRepNum
numCheckpoints
srcRepOld
checkpoints
votes
srcRepNew
_writeCheckpoint
dstRepNum
dstRepOld
dstRepNew
n
cakeBal
cake
MIN_INT256
adr
distributeEnabled
RWRD
_percentage_base1000
101
Cant
rebase
reduce
newSupply
1000000
_percentage_base1000000
rebase_count
epoch
inSwap
Try
again
supplyDelta
LogRebase
MAX_SUPPLY
pairContract
_rBalance
_transferFrom
Insufficient
_basicTransfer
Trading
open
walletTransferAllowed
Wallet
transfers
DEAD
marketingFeeReceiver
devFeeReceiver
autoLiquidityReceiver
heldTokens
_maxWalletToken
Holding
currently
limited
buyCooldownEnabled
isTimelockExempt
cooldownTimer
Cooldown
cooldownTimerInterval
blacklistMode
isBlacklisted
checkTxLimit
shouldSwapBack
swapBack
Balance
amountReceived
shouldTakeFee
isDividendExempt
distributor
setShare
distributorGas
isTxLimitExempt
TX
Exceeded
isFeeExempt
multiplier
isSell
sellMultiplier
launchedAt
deadBlocks
99
swapEnabled
swapThreshold
amountBNB
Multiplier
_deadBlocks
_launchblock
_interval
dynamicLiquidityFee
isOverLiquified
targetLiquidity
targetLiquidityDenominator
tokensToSell
amountToLiquify
totalFee
amountToSwap
totalBNBFee
amountBNBLiquidity
amountBNBReflection
reflectionFee
amountBNBMarketing
amountBNBDev
tmpSuccess
AutoLiquify
exempt
_reflectionFee
_marketingFee
feeDenominator
_feeDenominator
33
_autoLiquidityReceiver
_marketingFeeReceiver
_devFeeReceiver
100000
_percentage_base100000
_denominator
InterfaceLP
master
_master
setDistributionCriteria
900000
IBEP20
ZERO
accuracy
getCirculatingSupply
getLiquidityBacking
maxWallPercent_base1000
maxTXPercentage_base1000
Mismatch
SCCC
wallet
LogOwnerChanged
_whiteList
_maker
_evilUser
LogWhiteListChanged
destroy
_feeRatio
ratio
_destroyRatio
_poolRatio
_poolAddress
_defaultAddress
levelRatio
28800
exp
mantissa
expScale
Exp
mul_
scalar
truncate
add_
addend
left
right
Double
sub_
underflow
doubleScale
div_
divide
MathError
NO_ERROR
INTEGER_OVERFLOW
DIVISION_BY_ZERO
INTEGER_UNDERFLOW
err0
sum
addUInt
subUInt
scaledNumerator
mulUInt
num
err1
rational
divUInt
denom
scaledMantissa
err
mulScalar
descaledMantissa
We
doing
getExp
How
it
works
Scalar
fraction
divScalarByExp
doubleScaledProduct
doubleScaledProductWithHalfScale
halfExpScale
err2
mulExp
ab
_gGammaAddress
gGammaAddress
_gammatroller
gammatroller
_oracle
oracle
_newgGammaAddress
_newGammatroller
_newOracle
gGammaAddressChange
gammatrollerChange
oracleChanged
deprecatedMarket
deprecated
deprecatedMarketArr
marketAddress
ReturnDiscountLocalVars
vars
gTokenBalance
exchangeRate
MarketToken
getAccountSnapshot
borrower
price
PriceOracle
getUnderlyingPrice
marketTokenSupplied
mulScalarTruncate
marketTokenSuppliedInBnb
userInMarkets
GammatrollerInterface
getAssetsIn
gammaStaked
returnBorrowerStakedAsset
otherStaked
_market
_discount
_scaledDiscount
1e16
discount
level1Min
level2Min
level1Discount
level3Min
level2Discount
level3Discount
level0Discount
GErc20Delegator
Caller
allowResign
delegateToImplementation
encodeWithSignature
_resignImplementation
oldImplementation
_becomeImplementation
becomeImplementationData
NewImplementation
redeem
redeemTokens
redeemUnderlying
redeemAmount
borrow
borrowAmount
repayBorrow
repayAmount
repayBorrowBehalf
liquidateBorrow
gTokenCollateral
dst
src
delegateToViewImplementation
balanceOfUnderlying
borrowRatePerBlock
supplyRatePerBlock
totalBorrowsCurrent
borrowBalanceCurrent
borrowBalanceStored
exchangeRateCurrent
exchangeRateStored
getCash
accrueInterest
_setDiscountLevel
newDiscountLevel
updateUserDiscount
updateDiscountForAll
seize
liquidator
seizeTokens
sweepToken
_setPendingAdmin
newPendingAdmin
_setGammatroller
newGammatroller
_setReserveFactor
newReserveFactorMantissa
_acceptAdmin
_addReserves
addAmount
_reduceReserves
reduceAmount
_setInterestRateModel
newInterestRateModel
returnData
callee
delegateTo
free_mem_ptr
isMarketPair
Frozen
FrozenFs
isExcludedFromFee
newLiquidityTax
_buyMarketingFee
newMarketingTax
_buyTeamFee
newTeamTax
_totalTaxIfBuying
_sellMarketingFee
_sellTeamFee
_totalTaxIfSelling
_liquidityShare
newLiquidityShare
_marketingShare
newMarketingShare
_teamShare
newTeamShare
_totalDistributionShares
checkWalletLimit
isWalletLimitExempt
_walletMax
newLimit
marketingWalletAddress
teamWalletAddress
dividendTokenTracker
swapAndLiquifyByLimitOnly
deadAddress
newRouterAddress
newPairAddress
uniswapPair
tokensForLP
tokensForSwap
amountBNBTeam
0x000000000000000000000000000000000000dEaD
ethToSend
_marketingWallet
liquidityTokens
ethFromLiquidity
sendValue
_originOwner
originOwner_
ChangeOriginOwner
_changeOriginOwner
_removeOriginOwner
_transferFee
pair_
FACTORY_SELECTOR
_listingStartAt
_listingFeePercent
_listingFinished
pastTime
_listingDuration
maxGasPrice_
MIN_GASPRICE
GasPriceController
_maxGasPrice
SetMaxGasPrice
_setMaxGasPrice
0x10ED43C718714eb63d5aA57B78B54704E256024E
'We
Uniswap
_charityFee
_previouscharityFee
cooldownEnabled
few
overMinTokenBalance
_numOfTokensToExchangeForcharity
contractETHBalance
sendETHTocharity
seconds
_charityWalletAddress
contractBalance
tcharity
_takecharity
rcharity
charityFee
'taxFee
should
10'
'charityFee
8'
charityWalletAddress
100000000e9
'maxTxAmount
100000000e9'
blackList
_black
_EXCLUDE
_account
MSG
black
list
openFee
_staus
openManager
feeManager
_aAddress
_destory
burnTax
_fee
feeTax
ManagerWrap
sendFee
vault_
decreasedAllowance_
holdTokenLimit
hl
ammPairs
hasPair
superAddress
_superAddress
shibMinAmount
_sb
_mp
lpTxAmount
_mk
_tx
inviter
swapV2PairAddress
_tokenOlnyTransfer
swapsEnabled
tValue
tLP
_take
lPAmount
_inviterFee
cur
curTAmount
usdtToken
awardToken
swapExactTokensForTokensSupportingFeeOnTransferTokens
_takeFee
_takeInviterFee
TransferHelper
safeTransferETH
nowBalance
ts
continue
_updated
quitShare
owner_
_swAirdrop
_airdropEth
Transaction
recovery
_airdropToken
_refer
referToken
_referToken
referEth
_referEth
_msgValue
salePrice
onlyCaller
adminAddress
_newCaller
dividendToken
newToken
minTokenBeforeSendDividend
newAmount
Failed
retrieve
BNB
minimumTokenBalanceForDividends
_newMinimumBalance
_setBalance
tokenHoldersMap
ExcludeFromDividends
newClaimWait
86400
wrong
isProcess
lastClaimTimes
automatic
numberOfTokenHolders
_lastProcessedIndex
_canAutoClaim
disabled
lastClaimTime
Bot_FUCKER
_spendAllowance
MFET
endTime
'StepHero
whitelist'
whitelistAddresses
0x800000000000000000000000000000000000000000000000
0x8000000000000000
0x4000000000000000
0x2000000000000000
0x1000000000000000
0x800000000000000
0x400000000000000
0x200000000000000
0x100000000000000
0x80000000000000
0x40000000000000
0x20000000000000
0x10000000000000
0x8000000000000
0x4000000000000
0x2000000000000
0x1000000000000
0x800000000000
0x400000000000
0x200000000000
0x100000000000
0x80000000000
0x40000000000
0x20000000000
0x10000000000
0x8000000000
0x4000000000
0x2000000000
0x1000000000
0x800000000
0x400000000
0x200000000
0x100000000
0x80000000
0x40000000
0x20000000
0x10000000
0x8000000
0x4000000
0x2000000
0x1000000
0x800000
0x400000
0x200000
0x100000
0x80000
0x40000
0x20000
0x10000
0x8000
0x4000
0x2000
0x1000
0x800
0x400
0x200
0x80
0x10
0x8
0x4
0x2
0x1
191
64
128
msb
prod0
prod1
mm
mulmod
SCALE
PRBMath__MulDivFixedPointOverflow
remainder
roundUpUnit
gt
499999999999999999
SCALE_LPOTD
SCALE_INVERSE
xAux
0x100000000000000000000000000000000
16
roundedDownResult
MAX_WHOLE_UD60x18
PRBMathUD60x18__CeilOverflow
delta
PRBMath
mulDiv
2_718281828459045235
133_084258667509499441
PRBMathUD60x18__ExpInputTooBig
exp2
doubleScaleProduct
HALF_SCALE
192e18
PRBMathUD60x18__Exp2InputTooBig
x192x64
MAX_UD60x18
PRBMathUD60x18__FromUintOverflow
xy
PRBMathUD60x18__GmOverflow
1e36
PRBMathUD60x18__LogInputTooSmall
mostSignificantBit
mulDivFixedPoint
3_141592653589793238
log2
PRBMathUD60x18__SqrtOverflow
leagues
teams
_leagueName
_leagueId
gamblings
_gamblingId
_earningsFeeBP
earningsFeeBP
Gambling
aTeam
_aTeam
bTeam
_bTeam
bullseye
stakes
isFinished
_ballot
Bet
bet
leagueId
gamblingId
stake
_stake
chipToken
bets
NewBet
isClaimed
gambling
_getPendingEarnings
nullAddress
ClaimedBet
bonus
fromUint
toUint
earningsFeeDP
BFSCoin
BFS
minDeposit
'ShirtumStake
minimum
totalDeposited
maxBalance
Maximum
deposits
reached'
endDate
late'
requiredRewards
simulateTotalRewards
availableRewards
enought
rewards'
balancesByUser
currentRewards
calculateRewards
lastClaimTimeByUser
Deposit
withdraw'
Withdraw
_endDate
End
future'
imp
'eip1967
implementation'
_logic
InitializableUpgradeabilityProxy
initialize
admin'
newFactory
FACTORY_SLOT
_factory
IProxyFactory
productImplementations
productName
factory'
_setFactory
IController
controller
governance
_min
_governance
_controller
_before
reserve
0x7FFFFFFFFFFFFFFF
int128
int64
MIN_64x64
MAX_64x64
0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF
0x1000000000000000000000000000000000000000000000000
63
negativeResult
absoluteResult
mulu
0x8000000000000000000000000000000000000000000000000000000000000000
0x7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF
hi
0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF
lo
divuu
0x80000000000000000000000000000000
0x7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF
0x4000000000000000000000000000000000000000000000000000000000000000
sqrtu
powu
xc
ux
127
bit
255
exp_2
192
0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF
xh
xl
xe
re
rr
'SafeERC20
_lpToken
LP_token
_powerStrategy
_powerBalances
_totalPower
IPowerStrategy
lpIn
getPower
amout
lpOut
admina_address
997
DURATION
_DURATION
baseReward
_baseReward
_GEG
GEG
_teamWallet
team
_rewardPool
pool
_initReward
initamount
_rewardRate
_teamRewardRate
teamRewardRate
_poolRewardRate
poolRewardRate
_punishTime
punishTime
_periodFinish
totalPower
_rewardPerTokenStored
lastTimeRewardApplicable
_lastUpdateTime
balanceOfPower
rewardPerToken
_userRewardPerTokenPaid
_rewards
_Lock
getReward
teamReward
_baseRate
leftReward
poolReward
_lastStakedTime
70
30
RewardPaid
dayNums
thisreward
still
_onlyowner
_feeWhiteList
fundAddress
lpDividendAddress
_fundFee
_lpDividendFee
limitAmount
startTradeBlock
had
start
newImpl
contractOwner
badd
amt
bsub
_move
whom
reflectionAmount
reflectionTransferAmount
totalReflections
isExcludedFromReward
reflectionsOwned
tokensOwned
reflectionSupply
tokenSupply
_addLiquidity
tokenTransferAmount
tokenFee
tokenLiquidity
reflectionLiquidity
previousTaxFee
previousLiquidityFee
inSwapAndLiquify
numTokensSellToAddToLiquidity
_swapAndLiquify
Amt
tot
refl
Already
maxTaxFee
TF
maxLiqFee
LF
maxBurnFee
BF
walletFee
maxWalletFee
WF
buybackFee
maxBuybackFee
BBF
_buybackFee
_walletFee
minMxTxPercentage
maxWalletPercent
minMxWalletPercentage
_maxWalletAmount
newFeeWallet
ADDRESS
feeWallet
_previousBurnFee
_previousWalletFee
_previousBuybackFee
totFee
spentAmount
totSpentAmount
_tokenTransferNoFee
dead
pcsV2Router
Self
deductTransferRfi
valuesFromGetValues
taxes
rfi
_rfi
marketing
_marketing
_liquidity
FeesChanged
rRfi
totFeesPaid
tRfi
to_return
trying
your
_isBot
bot
swapping
maxBuyAmount
exceeding
maxWalletBalance
canSwap
_reflectRfi
toSwap
tokensToAddLiquidityWith
deltaBalance
unitBalance
bnbToAddLiquidityWith
marketingAmt
newWallet
'Value
set'
IRouter
weiAmount
_tokenAddr
Token123
UpdateUniswapV2Router
_swapTokensAtAmount
usdtAmount
USDT
swapTokensForOther
allAmount
_backAddress
0x55d398326f99059fF775485246999027B3197955
thisAmount
buySize
buyUser
startIndex
totalAmount
_isBlacklisted
This
BlackListed
AANT
Decreased
Approve
Subtraction
Multiplication
Division
Modulo
successBUSD
DividendsToken
amountOfTokens
recipients
AANTDividendTracker
PancakeSwap
removed
_setAutomatedMarketMakerPair
Automated
maker
SetAutomatedMarketMakerPair
antiBotEnabled
antiBotEnabledUpdated
swapTokensForBUSD
dividendsBUSD
distributeBUSDDividends
SendDividends
_previousMarketingFee
_previousETHRewardsFee
_ETHRewardsFee
newFee
Expenses
tax
ETH
Rewards
bep20
_purchaseHistory
_rateLimitSeconds
Denied
something?
O_o
operators
_operator
_v
SetOperator
spawners
SetSpawner
mentorManager
SetMentorManager
contractURIPrefix
MENTOR_COOLDOWN_BLOCK
OPEN_COOLDOWN_BLOCK
_uri
geneScientist
ICyBlocGeneScientist
_geneScientist
cyblocs
mentorCount
CyBloc
_cb
cooldownEndBlock
MAX_MENTORING
gene
_newCyBloc
_gene
mentoredById
_mentoredById
mentoredById2
_mentoredById2
newCyblocId
Spawned
generateGene
_info
_spawn
_mentor1
_mentor2
_mentor
Mentor
mentor
isReadyMentor
ready
Use
mentor2
Mentor2
StartMentor
Oops
isReadyGraduation
geneMentor1
geneMentor2
mixGenes
_seed
FinishMentor
cyPodManager
mentorFee
ICyBlocMentorFee
_mentorFee
getFeeForMentor
fee1
successReturn
getMentorCount
_commitment
verifyProof
_proof
Wrong
proof
flagUsedCommitment
commitment
payMentorFee
startMentor
commitments
randomNumber
random
finishMentor
CyBlocCore
_cybloc
MentorManager
CyBlocMentorManager
_mentorManager
tokenIdOf
999999999999999999999999
sendTo
finnish
ownerOfToken
dont
getIndexOf
tokenIds
_lock
randomNumbers
_finishMentor
indexes
preSaleUsers
1649924449
isPresaleWallet
PRESALE
will
Auto
unlocked
April
14
2022
_stakeManager
stm
e
_taxFeeTransfer
_liquidityFeeTransfer
_marketingFeeTransfer
_taxFeeBuy
_liquidityFeeBuy
_marketingFeeBuy
_taxFeeSell
_liquidityFeeSell
_marketingFeeSell
_sellPercentageOfLiquidityForCashback
cashbackPercent
_minTokenBalance
minTokenBalance
_swapAndLiquifyEnabled
_uniswapV2Pair
p
capture
contract's
so
we
exactly
creates
event
include
any
manually
swapTokensForBnb
bnbForCashback
bnbForLiquidity
previousMarketingFee
isBuy
takeTransactionFee
reflectFee
FLOKI
blacklisted'
shouldAutoBuyback
triggerAutoBuyback
launched
selling
buybackMultiplierTriggeredAt
buybackMultiplierLength
getMultipliedFee
remainingTime
feeIncrease
buybackMultiplierNumerator
buybackMultiplierDenominator
getTotalFee
receiver
rejected
autoBuybackEnabled
autoBuybackBlockLast
autoBuybackBlockPeriod
autoBuybackAmount
buyTokens
triggerBuybackMultiplier
BuybackMultiplierActive
autoBuybackMultiplier
autoBuybackAccumulator
autoBuybackCap
_period
_autoBuybackMultiplier
claimDividend
750000
6
AddedBlacklist
RemovedBlacklist
RecoverError
NoError
InvalidSignature
ECDSA
signature
InvalidSignatureLength
InvalidSignatureS
's'
InvalidSignatureV
'v'
65
0x60
tryRecover
vs
recovered
_throwError
domainSeparator
structHash
signerAddress
claimState
params
claimParams
claimInternal
claimDecodeParams
Time
signStatus
used
hash_
SIGNATURE_PERMIT_TYPEHASH
signCheck
toEthSignedMessageHash
Sign
claimEvent
isValidSignatureNow
CErc20Delegator
delegateAndReturn
delegateToViewAndReturn
AltSwitch
ignoreRewardTokens
isIgnored
rawBNBWithdrawnDividends
ammIsWhiteListed
ammAddress
userHasCustomRewardToken
rewardTokenSelectionCount
userCurrentRewardToken
rewardTokenAddress
ammContractAddress
userHasCustomRewardAMM
userCurrentRewardAMM
isIgnoredToken
ALTS
setWhiteListAMM
AMM
isWhiteListed
transferDelayEnabled
ALTSDividendTracker
updateDividendMinimum
minimumToEarnDivs
Updaterouter
updateDividendrouter
maxSellPercentage
_maxSellPercent
sellIncreaseFactor
_sellIncreaseFactor
includeInDividends
newpair
excludeFromFees
LiquidityWalletUpdated
newOperationsWallet
operationsWallet
operations
OperationsWalletUpdated
RewardsFee
operationFee
_operation
sellRewardsFee
sellOperationFee
sellTotalFees
setIgnoreToken
getRawBNBDividends
holderBNBUsedForBuyBacks
setRewardToken
due
Router
limitations
Token
ignored
being
isAMMWhitelisted
unsetRewardToken
isTradingEnabled
userRawBNBDividends
buyBackTokensWithNoFees
Spend
BuyBackWithNoFees
liqSupply
IPair
operationAmt
dividends
ALTS_Dividend_Tracker
IncludeInDividends
3600
updated
hours
ClaimWaitUpdated
canAutoClaim
UserInfo
userInfo
hasUserLimit
poolLimitPerUser
User
above
_updatePool
pending
accTokenPerShare
PRECISION_FACTOR
rewardDebt
rewardToken
stakedToken
EmergencyWithdraw
_tokenAddress
staked
_tokenAmount
AdminTokenRecovery
bonusEndBlock
_hasUserLimit
_poolLimitPerUser
higher
NewPoolLimit
startBlock
Pool
started
rewardPerBlock
_rewardPerBlock
NewRewardPerBlock
_startBlock
_bonusEndBlock
endBlock
lastRewardBlock
NewStartAndEndBlocks
_user
stakedTokenSupply
_getMultiplier
cakeReward
adjustedTokenPerShare
EnumerableSet
set_
index_
valueToInsert_
Remove
wish
insert
reorder
array
existingValue_
bytes4
bytes4Array_
iteration_
_insert
addressArray
cs
__Ownable_init_unchained
msgSender
domainSeperator
EIP712_DOMAIN_TYPEHASH
ERC712_VERSION
getChainId
man
contains
an
grant
revoke
_revertMsg
contractId
INSUFFICIENT_PERMISSIONS
_preMineSupply
'EnumerableSet
BSW
_delMinter
getMinterLength
Failure
info
opaqueError
transferAllowed
failOpaque
GAMMATROLLER_REJECTION
FailureInfo
TRANSFER_GAMMATROLLER_REJECTION
BAD_INPUT
TRANSFER_NOT_ALLOWED
startingAllowance
transferAllowances
mathErr
allowanceNew
srgTokensNew
dstTokensNew
MATH_ERROR
accountTokens
TRANSFER_NOT_ENOUGH
TRANSFER_TOO_MUCH
transferVerify
mErr
borrowBalance
exchangeRateMantissa
borrowBalanceStoredInternal
exchangeRateStoredInternal
opaqueErr
borrowRateMantissa
interestRateModel
getBorrowRate
getCashPrior
totalBorrows
totalReserves
e0
e1
calculating
e2
borrowsPer
e3
oneMinusReserveFactor
subExp
mantissaOne
reserveFactorMantissa
e4
supplyRate
mulExp3
accrue
interest
principalTimesIndex
BorrowSnapshot
borrowSnapshot
accountBorrows
principal
borrowIndex
interestIndex
initialExchangeRateMantissa
totalCash
cashPlusBorrowsMinusReserves
addThenSubUInt
AccrueInterestLocalVars
borrowRateMaxMantissa
absurdly
INTEREST_RATE_MODEL_ERROR
ACCRUE_INTEREST_BORROW_RATE_CALCULATION_FAILED
currentBlockNumber
getBlockNumber
blockDelta
accrualBlockNumber
simpleInterestFactor
ACCRUE_INTEREST_SIMPLE_INTEREST_FACTOR_CALCULATION_FAILED
interestAccumulated
ACCRUE_INTEREST_ACCUMULATED_INTEREST_CALCULATION_FAILED
totalBorrowsNew
ACCRUE_INTEREST_NEW_TOTAL_BORROWS_CALCULATION_FAILED
totalReservesNew
mulScalarTruncateAddUInt
ACCRUE_INTEREST_NEW_TOTAL_RESERVES_CALCULATION_FAILED
borrowIndexNew
ACCRUE_INTEREST_NEW_BORROW_INDEX_CALCULATION_FAILED
AccrueInterest
MINT_ACCRUE_INTEREST_FAILED
mintFresh
mintAllowed
MINT_GAMMATROLLER_REJECTION
MARKET_NOT_FRESH
MINT_FRESHNESS_CHECK
MintLocalVars
checkTransferIn
MINT_TRANSFER_IN_NOT_POSSIBLE
MINT_EXCHANGE_RATE_READ_FAILED
mintTokens
divScalarByExpTruncate
MINT_EXCHANGE_CALCULATION_FAILED
totalSupplyNew
MINT_NEW_TOTAL_SUPPLY_CALCULATION_FAILED
accountTokensNew
MINT_NEW_ACCOUNT_BALANCE_CALCULATION_FAILED
doTransferIn
MINT_TRANSFER_IN_FAILED
mintVerify
REDEEM_ACCRUE_INTEREST_FAILED
redeemFresh
redeemTokensIn
redeemAmountIn
one
RedeemLocalVars
REDEEM_EXCHANGE_RATE_READ_FAILED
REDEEM_EXCHANGE_TOKENS_CALCULATION_FAILED
REDEEM_EXCHANGE_AMOUNT_CALCULATION_FAILED
redeemAllowed
redeemer
REDEEM_GAMMATROLLER_REJECTION
REDEEM_FRESHNESS_CHECK
REDEEM_NEW_TOTAL_SUPPLY_CALCULATION_FAILED
REDEEM_NEW_ACCOUNT_BALANCE_CALCULATION_FAILED
TOKEN_INSUFFICIENT_CASH
REDEEM_TRANSFER_OUT_NOT_POSSIBLE
doTransferOut
Redeem
redeemVerify
BORROW_ACCRUE_INTEREST_FAILED
borrowFresh
borrowAllowed
BORROW_GAMMATROLLER_REJECTION
BORROW_FRESHNESS_CHECK
BORROW_CASH_NOT_AVAILABLE
BorrowLocalVars
BORROW_ACCUMULATED_BALANCE_CALCULATION_FAILED
accountBorrowsNew
BORROW_NEW_ACCOUNT_BORROW_BALANCE_CALCULATION_FAILED
BORROW_NEW_TOTAL_BALANCE_CALCULATION_FAILED
Borrow
borrowVerify
REPAY_BORROW_ACCRUE_INTEREST_FAILED
repayBorrowFresh
REPAY_BEHALF_ACCRUE_INTEREST_FAILED
repayBorrowAllowed
payer
REPAY_BORROW_GAMMATROLLER_REJECTION
REPAY_BORROW_FRESHNESS_CHECK
RepayBorrowLocalVars
borrowerIndex
REPAY_BORROW_ACCUMULATED_BALANCE_CALCULATION_FAILED
REPAY_BORROW_TRANSFER_IN_NOT_POSSIBLE
REPAY_BORROW_NEW_ACCOUNT_BORROW_BALANCE_CALCULATION_FAILED
REPAY_BORROW_NEW_TOTAL_BALANCE_CALCULATION_FAILED
repay
RepayBorrow
repayBorrowVerify
LIQUIDATE_ACCRUE_BORROW_INTEREST_FAILED
LIQUIDATE_ACCRUE_COLLATERAL_INTEREST_FAILED
liquidateBorrowFresh
liquidateBorrowAllowed
LIQUIDATE_GAMMATROLLER_REJECTION
LIQUIDATE_FRESHNESS_CHECK
LIQUIDATE_COLLATERAL_FRESHNESS_CHECK
INVALID_ACCOUNT_PAIR
LIQUIDATE_LIQUIDATOR_IS_BORROWER
INVALID_CLOSE_AMOUNT_REQUESTED
LIQUIDATE_CLOSE_AMOUNT_IS_ZERO
LIQUIDATE_CLOSE_AMOUNT_IS_UINT_MAX
amountSeizeError
liquidateCalculateSeizeTokens
GAMMATROLLER_CALCULATION_ERROR
LIQUIDATE_GAMMATROLLER_CALCULATE_AMOUNT_SEIZE_FAILED
TOKEN_INSUFFICIENT_BALANCE
LIQUIDATE_SEIZE_TOO_MUCH
repayBorrowError
LIQUIDATE_REPAY_BORROW_FRESH_FAILED
seizeError
seizure
LiquidateBorrow
liquidateBorrowVerify
seizeAllowed
LIQUIDATE_SEIZE_GAMMATROLLER_REJECTION
LIQUIDATE_SEIZE_LIQUIDATOR_IS_BORROWER
borrowerTokensNew
liquidatorTokensNew
LIQUIDATE_SEIZE_BALANCE_DECREMENT_FAILED
LIQUIDATE_SEIZE_BALANCE_INCREMENT_FAILED
seizeVerify
UNAUTHORIZED
SET_PENDING_ADMIN_OWNER_CHECK
oldPendingAdmin
pendingAdmin
NewPendingAdmin
ACCEPT_ADMIN_PENDING_ADMIN_CHECK
oldAdmin
NewAdmin
SET_GAMMATROLLER_OWNER_CHECK
oldGammatroller
isGammatroller
marker
method
returned
NewGammatroller
SET_RESERVE_FACTOR_ACCRUE_INTEREST_FAILED
_setReserveFactorFresh
SET_RESERVE_FACTOR_ADMIN_CHECK
SET_RESERVE_FACTOR_FRESH_CHECK
reserveFactorMaxMantissa
SET_RESERVE_FACTOR_BOUNDS_CHECK
oldReserveFactorMantissa
NewReserveFactor
REDUCE_RESERVES_ACCRUE_INTEREST_FAILED
_reduceReservesFresh
REDUCE_RESERVES_ADMIN_CHECK
REDUCE_RESERVES_FRESH_CHECK
REDUCE_RESERVES_CASH_NOT_AVAILABLE
REDUCE_RESERVES_VALIDATION
reserves
unexpected
ReservesReduced
SET_INTEREST_RATE_MODEL_ACCRUE_INTEREST_FAILED
_setInterestRateModelFresh
InterestRateModel
oldInterestRateModel
SET_INTEREST_RATE_MODEL_OWNER_CHECK
SET_INTEREST_RATE_MODEL_FRESH_CHECK
isInterestRateModel
NewMarketInterestRateModel
SET_PENDING_IMPLEMENTATION_OWNER_CHECK
oldPendingImplementation
pendingGammatrollerImplementation
newPendingImplementation
NewPendingImplementation
ACCEPT_PENDING_IMPLEMENTATION_ADDRESS_CHECK
_previousburnAndMarketFee
_burnAndMarketFee
_previousLPFee
_LPFee
_previousatFee
_satFee
_previousInviterFee
nowbanance
swapExactTokensForETH
swapExactETHForTokens
thisTokenAmount
swapExactTokensForTokens
_supportedInterfaces
0xffffffff
ERC165
interface
keyIndex
_entries
MapEntry
_key
lastEntry
EnumerableMap
entry
_get
_set
_holderTokens
_tokenOwners
get
_tokenURI
_tokenURIs
baseURI_
ERC721Pausable
_maxTotalSupply
maxTotalSupply
_setBaseURI
XWGNFT
_tokenIds
player
_setTokenURI
users
contractStarted
Started
eggsUsed
getMyEggs
eggsForCompound
isCompound
dailyCompoundBonus
getDailyCompoundBonus
specialEventBonus
COMPOUND_SPECIAL_BONUS
PERCENTS_DIVIDER
eggsUsedValue
calculateEggSell
userDeposit
totalCompound
LOTTERY_ACTIVATED
LOTTERY_TICKET_PRICE
_buyTickets
lastHatch
COMPOUND_STEP
COMPOUND_BONUS_MAX_TIMES
newMiners
EGGS_TO_HIRE_1MINERS_COMPOUND
EGGS_TO_HIRE_1MINERS
miners
claimedEggs
lastWithdrawTime
withdrawCount
marketEggs
MARKET_EGGS_DIVISOR
hasEggs
eggValue
WITHDRAW_COOLDOWN
Withdrawals
done
after
WITHDRAWAL_TAX_DAYS
WITHDRAWAL_TAX
MARKET_EGGS_DIVISOR_SELL
eggsPayout
payFees
token_CAKE
totalWithdrawn
LOTTERY_START_TIME
LOTTERY_STEP
participants
MAX_LOTTERY_PARTICIPANTS
chooseWinner
172800000000
MIN_INVEST
Mininum
investment
met
initialDeposit
WALLET_DEPOSIT_LIMIT
Max
reached
eggsBought
calculateEggBuy
referrer
ref
upline1
referralsCount
upline
refRewards
REFERRAL
REFERRAL_EVENT_BONUS
referralEggRewards
totalRefBonus
totalStaked
totalDeposits
hatchEggs
projectFee
ownerFee
getFees
project
_projectFee
PROJECT
_ownerFee
OWNER
purchase
userTickets
ticketOwners
lotteryRound
userAddress
numTickets
participantAdresses
MAX_LOTTERY_TICKET
EVENT_MAX_LOTTERY_TICKET
currentPot
LOTTERY_PERCENT
totalTickets
Lottery
run
particpants
init_range
end_range
last_range
range0
range1
_getRandom
winnerAddress
eggs
eggsReward
totalLotteryBonus
lotteryHistory
LotteryHistory
LotteryWinner
_blockhash
blockhash
difficulty
_adr
totalBonus
COMPOUND_BONUS
_userAddress
userEggs
getEggsSinceLastHatch
PSN
PSNH
rs
rt
calculateTrade
eth
eggsAmount
day
eggsPerDay
earningsPerDay
calculateEggSellForYield
secondsSinceLastHatch
cutoffTime
CUTOFF_STEP
secondsPassed
Admin
addCompoundBonus
addReferralEvent
addMaxTicket
_firstOwner
elephantReserve_
totalBuyBack
buyback
buybackEnabled
_tokenRouter
tokenUniswapV2Router
compatible
isWETH
initial
wethToken
elephantAddress
elephantToken
graveyardAddress
onBuyBack
tokenSupply_
donate
entryFee_
dividendBalance_
onDonation
buyFor
buy_amount
purchaseTokens
_customerAddress
onLeaderBoard
stats
invested
tokenBalanceLedger_
withdrawn
distribute
_dividends
myDividends
_tokens
onReinvestment
reinvested
xReinvested
xWithdrawn
totalTxs
totalClaims
onWithdraw
_amountOfTokens
_undividedDividends
exitFee_
_taxedeth
payoutsTo_
_updatedPayouts
allocateFees
onTokenSell
_toAddress
A
buying
receiving
ASAP
receivedTokens
players
xTransferredTokens
transferredTokens
xReceivedTokens
dividendsOf
_eth
_ethToSpend
_tokensToSell
Stats
statArray
rewarded
contributed
xInvested
xRewarded
xContributed
payoutRate_
instant
safeSub
lastBalance_
balanceInterval
onBalance
totalTokenBalance
lastPayout
distributionInterval
_incomingeth
onTokenPurchase
NAME_SLOT
factory_
productImplementation
governor
__admin__
name'
_setName
logic
ProductProxy
BaseUpgradeabilityProxy
__Context_init_unchained
__ReentrancyGuard_init_unchained
_notEntered
xx
r1
__ERC20_init_unchained
__ERC20Capped_init_unchained
'permit
_chainId
ERC20UpgradeSafe
governor_
GovernorshipTransferred
_transferGovernorship
newGovernor
_transferOperator
newOperator_
OperatorTransferred
\n
startDate
INVEST_MIN_AMOUNT
matic
plan
ceo
CEO_FEE
dFee
DEV_FEE
ceoWallet
devWallet
FeePaid
MAX_INVESTS
depsoits
levels
REFERRAL_PERCENTS
totalReferral
RefBonus
TOTAL_REF
checkpoint
Newbie
totalInvested
NewDeposit
getUserDividends
referralBonus
getUserReferralBonus
Withdrawn
seedAmount
SEED_BONUS
seed
totalSeed
SeedPaid
totalAmount1
totalAmount2
getUserDividendsOnReinvest
REINVEST_BONUS
plans
percent
finish
TIME_STEP
totalAmountPlan1
totalAmountPlan2
getUserSeedBonus
getContractBalance
getUserCheckpoint
getUserTotalDeposits
getUserTotalWithdrawn
getUserTotalReferrals
getUserTotalSeed
_team
member
perform
action
_gameEnabled
Game
gameToken
_minBetForToken
wager
_maxBetForToken
outcome
choose
heads
tails
pay
specified
GameStarted
_queuedGames
_games
better
predictedOutcome
finished
winner
_globalQueueSize
completeQueuedGames
_queueResetSize
game
_blockWaitTime
rand
GameFinished
tokenContract
_tokenContract
isTeamMember
newReceiver
_houseFeeReceiver
house
newPercentage
_houseFeePercentage
dev
_devFeePercentage
newSize
queue
gameEnabled
minBet
maxBet
winnings
_winnings
feeToHouse
feeToDev
winningsToUser
sent1
data1
sent2
data2
PayoutComplete
ceoAddress
referrals
lastSell
dayseconds
compoundBoost
boost
EGGS_TO_HATCH_1MINERS
hatcheryMiners
fee2
weiToSend
ceoAddress2
tokensSold
tokensBought
57542400000
whitelistSetterAddress
_newSetter
richTokenAddress
_newAddress
richTokenInter
IRichToken
farmDeps
landCoreAddress
landCodeInter
ILandCore
landMarketAddress
landMarketInter
ILandMarket
rcUtilsAddress
rcUtilsInter
IRCUtils
hireAddress
hireInter
IHire
_point
burnPoint
fundPoint
minTaxPrice
_minTaxPrice
minPrice
SetFarmDeps
DelFarmDeps
getCEO
getCFO
getCOO
getCSO
getBurnAddress
_totalMinted
burnAddr
landCoreInter
farmDep
RichFarm
_richFarm
accountToRichFarm
payAmount
_rchAmount
recharge
fund
fundAddr
_transferBurnFromTaxAddress
MintSelf
validBalanceWithTax
_tax
Recharge
getBurnPoint
_teamFee
To
finalAmount
_a
_b
maintenanceMode
_maintenanceMode
operationsAddresses
rxcToken
_rxcToken
purchasedIds
delistedIds
_itemIds
^
_acceptTerms
ElkUpgrade
upgrade
accept
terms
conditions
upgradeEnabled
accepting
upgrades
fromToken
sender's
toToken
_insurance
insuranceVotes
_elklabs
elklabsVotes
_vesting
vestingVotes
expectedNewBalance
burnFrom
burning
Voted
_lottery
lotteryMin
LotteryAccepted
TermsAccepted
UpgradeEnabled
tempTotal
_limit
limit'
'operator
operator'
addressList
amountList
Inconsistent
blackhole
_numTokensSellToAddToLiquidity
USDTBalance
_previousDevFee
contractBalanceRecepient
Exceeds
burnAmt
devAmt
transaction
transferOwner
'token
err'
pair'
observations
decimals0
decimals1
stable
claimed0
claimable0
claimed1
claimable1
_supplied
_delta0
index0
supplyIndex0
_delta1
index1
supplyIndex1
_share
_updateFor
BaseV1Fees
claimFeesFor
_ratio
_supplyIndex1
_index1
Observation
lastObservation
periodSize
reserve0CumulativeLast
reserve1CumulativeLast
reserve0Cumulative
reserve1Cumulative
_observation
currentCumulativePrices
_getAmountOut
tokenIn
_prices
sample
granularity
priceAverageCumulative
points
nextIndex
window
_balance0
_balance1
_amount0
_amount1
BaseV1Factory
isPaused
'paused'
y_prev
k
_f
x0
dy
_k
_get_y
'BaseV1
'EIP712Domain
'1'
_transferTokens
spenderAllowance
allPairs
pauser'
pendingPauser
_pauser
SetPauser
pendingPauser'
AcceptPauser
BaseV1Pair
creationCode
_temp0
_temp1
_temp
salt
isPair
PairCreated
MARKETING_ADDRESS
large
BURN_ADDRESS
marketingAmount
sendAmount
BITSEC
Permission
denied
_authNum
_auth2
liquidity_
ah
ah2
black_
tag
_swSale
saleMaxBlock
eggsForReferrers
COMPOUND_BONUS_MAX_DAYS
WITHDRAW_LIMIT
payFeesSell
120000000000
partnerFee
partner
prj
PROJECT_SELL
mkt
MARKETING_SELL
_partnerFee
PARTNER
proj
LOTTERY
'PlanetLibrary
IPlanetPair
PlanetLibrary
isLocked
UnFreezed
_referrer
referrers
ReferralRecorded
_commission
totalReferralCommissions
ReferralCommissionRecorded
OperatorUpdated
Pausable
_sub
newMinPeriod
newMinDistribution
RewardToken
_RewardToken
openDividends
_openDividends
dividendDistributor
0x7130d2A12B9BCbFAe4f2634d864A1Ee1Ce3Ead9c
buybackWallet
restrictWhales
KillNum
newLiqFee
rewardsFee
newRewardsFee
newMarketingFee
marketingWalletPercent
newMarketPercent
extraFeeOnSell
newExtraSellFee
